{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "24375664", "review_id": "5cd416f3efc3f944fce4ce2db2290d5e", "rating": 5, "review_text": "Mind blowingly cool. Best science fiction I've read in some time. I just loved all the descriptions of the society of the future - how they lived in trees, the notion of owning property or even getting married was gone. How every surface was a screen. \n The undulations of how society responds to the Trisolaran threat seem surprising to me. Maybe its more the Chinese perspective, but I wouldn't have thought the ETO would exist in book 1, and I wouldn't have thought people would get so over-confident in our primitive fleet's chances given you have to think that with superior science they would have weapons - and defenses - that would just be as rifles to arrows once were. \n But the moment when Luo Ji won as a wallfacer was just too cool. I may have actually done a fist pump. Though by the way, if the Dark Forest theory is right - and I see no reason why it wouldn't be - we as a society should probably stop broadcasting so much signal out into the universe.", "date_added": "Fri Aug 25 13:55:02 -0700 2017", "date_updated": "Mon Oct 09 08:55:59 -0700 2017", "read_at": "Sat Oct 07 00:00:00 -0700 2017", "started_at": "Sat Aug 26 00:00:00 -0700 2017", "n_votes": 16, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "18245960", "review_id": "dfdbb7b0eb5a7e4c26d59a937e2e5feb", "rating": 5, "review_text": "This is a special book. It started slow for about the first third, then in the middle third it started to get interesting, then the last third blew my mind. This is what I love about good science fiction - it pushes your thinking about where things can go. \n It is a 2015 Hugo winner, and translated from its original Chinese, which made it interesting in just a different way from most things I've read. For instance the intermixing of Chinese revolutionary history - how they kept accusing people of being \"reactionaries\", etc. \n It is a book about science, and aliens. The science described in the book is impressive - its a book grounded in physics and pretty accurate as far as I could tell. Though when it got to folding protons into 8 dimensions I think he was just making stuff up - interesting to think about though. \n But what would happen if our SETI stations received a message - if we found someone was out there - and the person monitoring and answering the signal on our side was disillusioned? That part of the book was a bit dark - I would like to think human reaction to discovering alien civilization that is hostile would be more like Enders Game where we would band together. \n I did like how the book unveiled the Trisolaran culture through the game. It was a smart way to build empathy with them and also understand what they've gone through across so many centuries. And who know a 3 body problem was an unsolvable math problem? But I still don't get who made the game - maybe that will come in the next book. \n I loved this quote: \n \"In the long history of scientific progress, how many protons have been smashed apart in accelerators by physicists? How many neutrons and electrons? Probably no fewer than a hundred million. Every collision was probably the end of the civilizations and intelligences in a microcosmos. In fact, even in nature, the destruction of universes must be happening at every second--for example, through the decay of neutrons. Also, a high-energy cosmic ray entering the atmosphere may destroy thousands of such miniature universes....\"", "date_added": "Sun Jul 30 07:44:10 -0700 2017", "date_updated": "Wed Aug 30 00:00:26 -0700 2017", "read_at": "Sat Aug 26 12:05:52 -0700 2017", "started_at": "Tue Aug 15 13:23:18 -0700 2017", "n_votes": 28, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "6392944", "review_id": "5e212a62bced17b4dbe41150e5bb9037", "rating": 3, "review_text": "I haven't read a fun mystery book in a while and not sure I've ever read Poirot. Was looking for a fun read set in France while I was on holiday there and this didn't disappoint! Fast paced and good mystery. \n One that struck me was how similar Poirot is to Sherlock. They are both detectives, have a ex-military sidekick who is telling the story, and solve mysteries using their superior wit. Poirot seems like a French Sherlock. I'm curious if he was inspired by Sherlock.", "date_added": "Mon Jul 24 02:48:17 -0700 2017", "date_updated": "Sun Jul 30 09:28:03 -0700 2017", "read_at": "Tue Jul 25 00:00:00 -0700 2017", "started_at": "Mon Jul 24 00:00:00 -0700 2017", "n_votes": 6, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "22078596", "review_id": "fdd13cad0695656be99828cd75d6eb73", "rating": 4, "review_text": "Fun, fast paced, and disturbing tale of murder. Great beach read while in France, which is where its set. \n I enjoyed learning more about perfume and the power of scent - hearing the descriptions of how different kinds of scents are captured (distilled, oils, etc) was very interesting. I think in general we (certainly I) don't pay much attention to the power that scent holds over us in different situations. I will pay more attention now after reading this. Though I wish I had a stronger nose - curious if there are ways to cultivate that. My wife and I once bought a game at a wine store that had 30 different materials that they use in wine and you had to guess what they were. I think I got 3 out of 30 right :( \n This was a dark and twisted book though be forewarned - I generally don't like reading first person accounts of murderers - but in this case it was gripping. And the climax (yes that was a pun) was so ridiculous and fun that it was worth it.", "date_added": "Mon Jul 24 02:33:09 -0700 2017", "date_updated": "Sun Jul 30 10:23:54 -0700 2017", "read_at": "Sun Jul 30 15:42:05 -0700 2017", "started_at": "Tue Jul 25 00:00:00 -0700 2017", "n_votes": 22, "n_comments": 4}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "6644782", "review_id": "bd0df91c9d918c0e433b9ab3a9a5c451", "rating": 4, "review_text": "A fun book that gives you a sense of living in Paris as an expat and what to appreciate about French culture. Narrated by the author so definitely recommend listening. Great read while on vacation in France. I loved many of the annecdotes were hilarious - eg the one about how the gym had no plan for visiting every day they only had a once a week plan. Or the one comparing the French fax error codes to French culture.", "date_added": "Mon Jul 24 02:28:14 -0700 2017", "date_updated": "Thu Aug 24 00:07:20 -0700 2017", "read_at": "Sat Aug 05 00:00:00 -0700 2017", "started_at": "Sun Jul 30 00:00:00 -0700 2017", "n_votes": 8, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "1995421", "review_id": "7350a30a2f5c785b190d9ebd1c0b4af9", "rating": 0, "review_text": "Kevin highly recommended on instagram", "date_added": "Mon Mar 06 07:14:44 -0800 2017", "date_updated": "Mon Mar 06 07:15:21 -0800 2017", "read_at": "", "started_at": "", "n_votes": 4, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "9460786", "review_id": "fc24c814e34ec6da3aa5293b7ec70dd9", "rating": 4, "review_text": "Giving a high rating because I heard the organizer of the Long Now Foundation speak and it was very inspiring. The Interval Cafe in San Francisco is also awesome and has The Long Library in it. \n The part of the story that I liked most was the power of long thinking. How Oxford College has some gorgeous oak tree beams in their dining room, and they were crumbling, and so they wondered how to replace them. They created a search, and happened to ask the Oxford groundskeeper if any of the oak trees on campus would work, and he said yes, they should use the grove that was planted 500 years ago for that very purpose. So they did, and then planted another grove for 500 years from now. That's the power of long term thinking - how many of us are able to think that far ahead? That story is what inspired the clock, which is getting closer to completion and sounds pretty cool. \n The book was published in 1999 so I found a bunch of the ideas dated and found myself skimming through them, so only partially read this.", "date_added": "Tue Feb 28 17:52:08 -0800 2017", "date_updated": "Fri May 26 12:04:23 -0700 2017", "read_at": "Fri May 26 15:17:45 -0700 2017", "started_at": "Fri May 05 00:00:00 -0700 2017", "n_votes": 13, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "29983426", "review_id": "18479ea761f5f7d66d53cf753d6a3186", "rating": 5, "review_text": "I decided to give up eating processed sugar for the month of January, and so reading a book with this title seemed like it would help me adhere. And not only did it succeed in that goal, but I think it put a permanent, deep scare in me about sugar. The book basically argues that sugar is the root cause of obesity, diabetes, heart disease, and even a lot of cancer. \n What is interesting is while all of us know that sugar is not good for us, the only thing that people officially blame on overconsumption of it is tooth decay. Obesity is highly correlated with diabetes, heart disease, and a number of other bad things. If you Google for the cause of obesity, you see statements like \"Obesity is generally caused by eating too much and moving too little. If you consume high amounts of energy, particularly fat and sugars, but don't burn off the energy through exercise and physical activity, much of the surplus energy will be stored by the body as fat.\" This book makes the argument that a calorie is not a calorie, that sugar is actually toxic, but unlike other toxins it takes decades of overconsumption to show up - which has made it hard to prove. \n The statistics are fascinating. Fifty years ago, one in eight American adults was obese; today the number is greater than one in three. Diabetes has gone from 1 in 2,000-3,000 to 1 in 7-8, which is an astounding increase. The book listed numerous examples of native populations that suffered from a similar diabetes epidemic after adopting the \"western diets and lifestyle\". What is it about western lifestyle that has done this? The culprit is almost certainly something in the diet, and linked to processed foods - and after reading this book, it seems very logical that sugar is either the root or one of the main root causes. \n \"By the late 1970s, though, sugar had mostly vanished from the discussion. Dietary fat had been implicated as a cause of heart disease. Nutritionists and public-health authorities responded by rejecting the idea that sugar could be responsible for the diseases that associated with heart disease, which included both obesity and diabetes.\" \n The book gives a fascinating history of how nutritionists and the government have viewed sugar as largely harmless. This included an impressive amount of lobbying from the sugar industry to vindicate themselves. Mind-blowingly, the sugar industry back in the 50's actually advertised sugar as a great, healthy way to get calories. Sugar has never, and largely is still not thought of as a root cause of obesity - the narrative is still more about fats and \"lifestyle\" (i.e. lack of exercise). \n \"To the sugar industry, it has been the gift that keeps on giving, the ultimate defense against all arguments and evidence that sugar is uniquely toxic. This is the idea that we get obese or overweight because we take in more calories than we expend or excrete. By this thinking, researchers and public-health authorities think of obesity as a disorder of \"energy balance,\" a concept that has become so ingrained in conventional thinking, so widespread, that arguments to the contrary have typically been treated as quackery, if not a willful disavowal of the laws of physics.\" \n \"Fat\" is often the culprit named for people getting fat (even the word is the same!), and thus was born a processed food industry that touts \"low-fat\" items (which are then rich in sugar+salt to offset the bad taste). But looking at populations that eat high fat content but low sugar, shows lower rates of obesity and heart disease. For instance, the French. \n \"When researchers realized that the French had relatively low rates of heart disease despite a diet that was rich in saturated fats, they wrote it off as an inexplicable \"paradox,\" and ignored the fact that the French traditionally consumed far less sugar than did populations-- the Americans and British, most notably-- in which coronary disease seemed to be a scourge. At the end of the eighteenth century, French per capita sugar consumption was less than a fifth of what it was in England. At the end of the nineteenth century, even after the beet-sugar revolution, France was still lagging far behind both the British and the Americans-- thirty-three pounds for the French compared with eighty-eight for the English and sixty-six for Americans.\" \n Interestingly, when we say \"sugar\" we can actually be referring to a number of things: fructose, glucose, or sucrose. Glucose is used to refer to blood sugar levels in blood, and also comes from eating carb rich foods like bread or potatoes. Sucrose is table sugar, which actually made of part fructose. Fructose is the scary one because \"it is very different from other sugars because it has a different metabolic pathway and is not the preferred energy source for muscles or the brain.\". Fructose is found in fruit but as such low levels that it isn't harmful, plus its offset by rich fibers. But high fructose corn syrup? Avoid at all costs. \n The logic is basically: IF excess sugar (fructose notably) leads to insulin resistance, THEN we can say with confidence that it is likely a root cause of obesity, diabetes, heart disease, and even cancer, as it's been proven to be correlated with all those things. High fat diets - particularly the wrong sorts of fats - are also involved if eaten in excess. The logic seems solid - and yet even searching \"what causes obesity\" you don't see sugar named as a key cause. I'd be very curious to learn from nutritionists what the think of this logic. \n \"Is it that we're all simply eating too much and exercising too little, which is the one simple answer that the nutritional establishment will embrace in the face of so much evidence to the contrary? Another simple answer, and a more likely one, is sugar.\"", "date_added": "Sun Jan 08 15:51:29 -0800 2017", "date_updated": "Tue Mar 07 01:09:18 -0800 2017", "read_at": "Mon Feb 20 00:00:00 -0800 2017", "started_at": "Fri Jan 13 00:00:00 -0800 2017", "n_votes": 26, "n_comments": 6}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "29893493", "review_id": "c23406fb584d6304d1dd4c75ce26ea3a", "rating": 5, "review_text": "I haven't read a non-fiction book this engaging in some time. This was an amazingly well written autobiography. It read like a fast paced novel through much of it. Many autobiographies are too long - this one if anything is too short! Like many startup companies, the story of Nike (or Blue Ribbon Shoes as it was initially called) is one of trials, tribulations, and lots of passion and grit. I ate it up, and highly recommend it. \n The most defining moment of the story is Knights ballsy move while backpacking through Japan at the age of 24, to walk into a Japanese shoe manufacturer and say he has a shoe distribution company, and get a exclusive deal for the western US. Gutsy. He \"just did it\" (sorry, but apt). I love learning examples of this kind of \"Do things that don't scale\" start to successful companies (eg Zappos, Amazon, many more). From there the story is one of doubling sales each year, and never quite having enough money on the balance sheet to make it anything but very risky. It was interesting - no fascinating - that Phil had an accounting background, and was well versed that the reason most startups fail is a lack of cash reserves, and yet he had so much faith in his growth and sales that he kept plowing all cash into growth. I loved reading the stories of how they barely made it from one order to the next, how twice they had to switch banks after being cut off. \n One of the key strategies of Nike's success today is athlete endorsement, and it was interesting to see how that strategy was formed in the early years. How they would offer large sums of money to athletes to wear their shoes - often to athletes already wearing their shoes - double down on people who already like your product. It was doubly interesting that Phil didn't initially believe in the power of advertising - I'd be very curious to hear how his opinion on that changed over time. \n The story of Prefontaine was a touching one, and one that stayed with me. I wasn't as familiar of the story of Pre, but had heard of him. But I didn't know the role that Nike sponsored him, and even employed him. Reading Phil talk about him, you got a sense of the passion his has for the sport of running. You got a sense that the story of Pre - his passion and drive - is a metaphor for how Nike was built. This quote says it better: \n \"For eleven laps they ran a half stride apart. With the crowd now roaring, frothing, shrieking, the two men entered the final lap. It felt like a boxing match. It felt like a joust. It felt like a bullfight, and we were down to that moment of truth--death hanging in the air. Pre reached down, found another level--we saw him do it. He opened up a yard lead, then two, then five. We saw Young grimacing and we knew that he could not, would not, catch Pre. I told myself, Don't forget this. Do not forget. I told myself there was much to be learned from such a display of passion, whether you were running a mile or a company.\" \n The book is a fascinating telling of the founding and early history of Nike. But it stops at the IPO, and then gives a chapter postlude. This is my only complaint. It was so well written - keep going! Tell us the story of Just Do It, Air Jordans, and so many more. I could read 4 more volumes of this, as it feels like there is so much more to they story of Nike to learn.", "date_added": "Thu Dec 15 10:51:26 -0800 2016", "date_updated": "Sun Mar 12 23:33:51 -0700 2017", "read_at": "Thu Mar 09 15:34:06 -0800 2017", "started_at": "Tue Feb 28 17:55:35 -0800 2017", "n_votes": 29, "n_comments": 8}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "28114110", "review_id": "fb5bdf2100832503e17ef0c8dd1add7f", "rating": 4, "review_text": "Kevin Kelly, who is a Wired co-founder, lays out technological trends that are \"inevitable\". Like too many nonfiction books, I found a few chapters to be worth reading, and a few not to be. I enjoyed the sections on AI and books. And sometimes just zooming out to get bigger perspective is engaging, which was the case for me in the sections on VR/AR and tracking. Much of the rest of the book seemed geared for people less technically savvy, which was my only complaint as it really drew the book out. \n There is a famous saying in software said by Marc Andreeson that \"software is eating the world\". Kelly predicts, I believe correctly, that the next phase of this will be AI: \"It is hard to imagine anything that would \"change everything\" as much as cheap, powerful, ubiquitous artificial\". Kelly's perspective here that while it might feel like innovation in technology is slowing to some, it is much more likely that we are on the brink of the next renaissance, and we will all be \"taking X and adding AI\", much as happened with electricity and then the internet. \n Kelly correctly identified the three key trends that are making AI an exciting space today: processing power (GPU's), data, and better algorithms. However he didn't dive more into the longest pole: how to get a lot more data than we have today - that seems to me to be the key. But cool to get an overview. He did address one of the big fears about automation that many people have today: will computers take all our jobs? The quick answer is yes, but we'll have new ones. This has already happened multiple times in history. I agree with this, but think the more interesting question is what will happen when we can provide most people the basics (food, water, shelter) for very little cost. This was predicted in Diamond Age, and the answer was \"parking lots and chaos\", and a lot of people with no purpose in life. \n I also greatly enjoyed the section on books, mostly because (1) Goodreads is mentioned (hey I have paternal pride), and (2) it talks about things we at Goodreads are working on. Such as, the ability to see other peoples notes: \"Reading becomes social. With screens we can share not just the titles of books we are reading, but our reactions and notes as we read them. Today, we can highlight a passage. Tomorrow, we will be able to link passages.\" Well, here are my notes from this book! \n Another big idea that Kelly hits on that I think is big and inevitable is how each book will become networked, much as the WWW has. Once we have ability to have pointers into and out from each sentence of a book, the speed at which ideas will fly out of books will step function. \n In the goodness of time, as all books become fully digital, every one of them will accumulate the equivalent of blue underlined passages as each literary reference is networked within that book out to all other books. Each page in a book will discover other pages and other books. Thus books will seep out of their bindings and weave themselves together into one large metabook, the universal library. The resulting collective intelligence of this synaptically connected library allows us to see things we can't see in a single isolated book.", "date_added": "Sun Dec 11 16:18:32 -0800 2016", "date_updated": "Tue Dec 27 07:29:33 -0800 2016", "read_at": "Sat Dec 17 00:00:00 -0800 2016", "started_at": "Sun Dec 11 00:00:00 -0800 2016", "n_votes": 14, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "16981", "review_id": "a5d2c3628987712d0e05c4f90798eb67", "rating": 3, "review_text": "Recommended by Don Katz. Avail for free in December: http://www.audible.com/mt/ellison2?so...", "date_added": "Mon Dec 05 10:46:44 -0800 2016", "date_updated": "Wed Mar 22 11:37:04 -0700 2017", "read_at": "", "started_at": "", "n_votes": 1, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8191070", "review_id": "8fb75b37b3613a34e39169f139870f31", "rating": 5, "review_text": "Best book of the series, and best book about American history that I think I've read. Now we are getting to the drama and corruption at an interesting scale - the US Senate. And the portrait we have of Johnson is fascinating. \n Lyndon Johnson was just simply power hungry. He had no principles of note, no things he was on a mission to do - except to hold as much power as he could. But he was brilliant at reading people, knowing what they wanted, and finding ways to horse-trade in his huge and growing network - and help them get it. A genius at being a politician. But lacking principles - I hope there are politicians that can do both. \n But this is not just a book about LBJ and his time in the senate - it is a history of the senate, and of 1960's America. I didn't appreciate the power the Senate has in US politics - small numbers of senators can block legislation for a long time. The book hints that WWII can be blamed on the senate - because the president wanted to act against Hitler much earlier but the senate didn't let him - a crazy allegation if true. And the filibusters! I didn't appreciate what those really were and how powerful they were. It was also very impressive reading how quickly LBJ took over leadership of the Senate - most senators had to wait until they were old to have the seniority to do much - LBJ within two years of being a senator had become elected leader and then did away with the seniority rule - both unprecedented changes. \n And of course, much of the book is about the fact that the southern senators collaborated to prevent any civil rights legislation for 100 years. It was well into the 20th century before African Americans got the right to vote, and we removed segregation - and this delay is all due to the senate. \n LBJ is known for being the president who passed civil rights - but the story of how he was a \"southern senator\" (from Texas) who had the southern senators as his base, but had to pass civil rights bills through the senate in order to make the liberals believe he was on their side so he could have a presidential bid - was fascinating. He did it not caring a single bit about the actual cause - it was simply the only path to be president, as the country had hit a point where the northerners were no longer going to let segregation go on, and the southerners were only going to give it up over their dead bodies. LBJ worked both sides, found compromises, made each side believe he was really on their side, and got the first ever civil rights bill of the 1900's passed to give African Americans the right to vote.", "date_added": "Fri Nov 18 17:43:26 -0800 2016", "date_updated": "Thu Aug 03 22:54:31 -0700 2017", "read_at": "Mon Jul 24 09:32:34 -0700 2017", "started_at": "Mon May 08 07:52:12 -0700 2017", "n_votes": 25, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "28684704", "review_id": "2ede853b14dc4583f96cf5d120af636f", "rating": 3, "review_text": "A fun, fast paced science fiction thriller. I read it in 2 nights and couldn't put it down. The book is about the quantum theory of many worlds which states that all decisions we make throughout our lives basically create branches, and that each possible path through the decision tree can be thought of as a parallel world. And in this book, someone invents a way to switch between these worlds. This was nicely alluded to/foreshadowed in this quote: \n \"I think about all the choices we've made that created this moment. Us sitting here together at this beautiful table. Then I think of all the possible events that could have stopped this moment from ever happening, and it all feels, I don't know...\" \"What?\" \"So fragile.\" Now he becomes thoughtful for a moment. He says finally, \"It's terrifying when you consider that every thought we have, every choice we could possibly make, branches into a new world.\" \n This book can't be discussed without spoilers. It is a book about choice and regret. Ever regret not chasing the girl of your dreams so you can focus on your career? Well Jason2 made that choice and then did regret it. Clearly the author is trying to tell us to optimize for happiness - to be that second rate physics teacher at a community college if it means you can have a happy life. I'm being snarky because while there is certainly something to that, you also have to have meaning in your life that comes from within. I thought the book was a little shallow on this dimension. In fact, all the characters were fairly shallow. Daniela was the perfect wife. Ryan the perfect antithesis of Jason. Amanda the perfect loyal traveling companion, etc. This, plus the fact that the book was weak on the science are what led me to take a few stars off - but I'd still read it again if I could go back in time - was a very fun and engaging read. \n If you want to really minimize regret, you have to live your life to avoid it in the first place. Regret can't be hacked, which is kind of the point of the book. My favorite book about regret is Remains of the Day. I do really like the visualization of the decision tree though - that is a powerful concept. \n \"Every moment, every breath, contains a choice. But life is imperfect. We make the wrong choices. So we end up living in a state of perpetual regret, and is there anything worse? I built something that could actually eradicate regret. Let you find worlds where you made the right choice.\" Daniela says, \"Life doesn't work that way. You live with your choices and learn. You don't cheat the system.\"", "date_added": "Tue Nov 15 11:29:22 -0800 2016", "date_updated": "Mon Mar 20 23:40:27 -0700 2017", "read_at": "Sat Mar 18 23:22:42 -0700 2017", "started_at": "Fri Mar 17 23:45:40 -0700 2017", "n_votes": 22, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "27161156", "review_id": "ced5675e55cd9d38a524743f5c40996e", "rating": 0, "review_text": "Recommended reading to understand what is going on in middle america, and possibly better explain why Trump won. http://www.npr.org/2016/11/09/5013826...", "date_added": "Wed Nov 09 17:37:04 -0800 2016", "date_updated": "Wed Nov 09 17:38:20 -0800 2016", "read_at": "", "started_at": "", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "32768285", "review_id": "6d37be8de2959abec5cb7a0d7b62c89f", "rating": 5, "review_text": "A fun, humorous, fast-paced, and fascinating take on what happens when an AI awakens. In order to tell this story, Reid invents a fictional Silicon Valley company called Pluttr, which seems sort of like a mashup of Snapchat+Facebook+WeChat but with more big data about us all, so it's able to really personalize it's experience. Frankly it seems like a good idea and where the afore mentioned companies are likely going. And this is one of my favorite things about good science fiction - it predicts the future. While not everything about this novel will come true, it is clear that Reid - who is a former tech CEO himself (and disclosure, a friend) - did his homework about technological trends and weaves them in nicely to a thrilling singularity story (Note: the book doesn't use the word \"singularity\" at all, in a homage to current silicon valley trends, because for some reason that I get but don't quite understand that word is passe - but instead to renames it \"the omega point\"). \n One of the most interesting aspects of the book for me is the fictional company Phluttr. I mean, when an AI finally awakens you'd have to put your money on Google doing it (if it happens in the private sector) - they are the furthest along in the intersection of having the key ingredients: lots of data about people, AI technology, and computing power. But I suppose it would be weird to use a real company - Dave Eggers The Circle was similar in describing a company that was basically FB+Google. But as I said, it does seem like the descriptions of Phluttr will happen, once the both the AI improves (pretty much possible now), the dataset known about each user vastly increases (happening in some pockets), and computing power improves (will be there soon). And thinking through the possibilities of what that will enable was super fun. For instance, there was an scene in the beginning of the book where Phluttr deduced that two of the characters were at the same bar and likely there on a date, and gave them coupons and messages/information appropriate to that deduction. \n One of the more interesting philosophical questions tackled by the book is: should we try to accelerate creation of a super AI? Since the first one created will have a decisive advantage and any other super AI's created will never catch up to its intelligence nor power. Many think that the creation of a super AI is inevitable anyways, and there is a chance that whoever creates it may retain some control or benefit - though there is a very high risk you wouldn't - which is the debate. The book has characters that take both sides of this question, but ultimately lands that major countries (US, China, others) will get into an \"arms race\" and strive to create it. Doesn't seem unlikely. AI in general (regardless of a super AI) will be the next nuclear arms race, no question - already is if you look at all the hacking and security issues (eg US presidential election). \n But don't let my introspections about the subject matter make you think this is a deep thinking AI book. It is a fast paced, fun thriller with a twist at the end. It's also got a good amount of self-deprecating-silicon-valley humor - eg I loved the fictional persuadif.er blog, with posts such as \"Eat on the phone\" and then you find poor characters like Pugwash doing just that. Or fun references thrown in like how Tim Tebow is now a VR tycoon (huh?). Bottom line: this captures interesting technological trends in a humorous & thrilling read - highly recommended!", "date_added": "Thu Nov 03 08:39:30 -0700 2016", "date_updated": "Mon Feb 27 10:05:54 -0800 2017", "read_at": "Sun Feb 26 15:54:47 -0800 2017", "started_at": "Fri Jan 13 00:00:00 -0800 2017", "n_votes": 16, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "32283133", "review_id": "8e4d61801907e591018bdc3442a9cf2b", "rating": 0, "review_text": "http://www.telegraph.co.uk/culture/10...", "date_added": "Tue Nov 01 11:09:18 -0700 2016", "date_updated": "Tue Nov 01 11:09:44 -0700 2016", "read_at": "", "started_at": "", "n_votes": 9, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "16064871", "review_id": "0737dc907735d9c77d21b676ec4ba658", "rating": 5, "review_text": "A fascinating look at the early part of LBJ's life and career. This is the first of a four book series covering LBJ's life. At least 3 extremely smart people that I respect told me that this series was one of the best books they've ever read. I was also interested in reading about politics and corrupt politicians to get some grounding given the current political climate, and even in volume 1, this didn't disappoint. \n Many biographies spend way too much time on details that are not very relevant, especially in the early life, and this book was no exception - although I found the writing good and story compelling that I finished it rather quickly (also thanks to whispersync with Audible). The book covers Johnsons childhood up through age 32 when he as a congressman lost the race for senate to Pappy O'Daniel. Pappy O'Daniel by the way, sounds like fun character - totally unqualified to be governor or senator but elected b/c everyone knew him from his radio show. In terms of Johnsons childhood, it was oddly interesting to learn about the \"Hill Country\" of Texas and why those who have lived there have had such rough lives. \n I love biographies, as it's always fascinating to see what motivates successful people - where their drive comes from. With LBJ, Caro paints his motivation as initially coming from not wanting to grow up poor and in debt like his father. But then his motivation shifts to become more \"a hunger for power in its most naked form, for power not to improve the lives of others, but to manipulate and dominate them, to bend them to his will.\" \n Johnson's raw hunger for power, his desire to be someone, led him to work extremely hard. And not only himself, but also the people who worked for him. It was impressive how hard he worked himself and his small team when he was working as a congressional aide. And all driven by a lust for power. Interestingly to me, he picked exclusively people who were \"loyal\" to him - meaning he could work them to the bone - over people who were intelligent or experienced in what needed to be done. He was able to pull this off as in the post great depression era, a lot of people had no other way to get a job, or get ahead, and so LBJ had leverage. But LBJ did have a gift in picking and reading men, which was I think key to understanding his success. \n \"if Lyndon Johnson was not a reader of books, he was a reader of men-- a reader with a rare ability to see into their souls.\" \n And he was not only a reader of men - he could also remember everything about the people he met - he could impressively remember details about a persons son 10 years after meeting them. Great skill for a politician to have! He also had an uncanny ability to make older men look at him like a son - a skill he used with Speaker of the house Sam Rayburn, which greatly helped his career. \n Johnson also had no qualms cheating to steal elections - with both his election to school president in college, and the little congress, he cheated. \n A fascinating piece of LBJ was that he worked very hard to not commit to a public position on almost anything. He basically told people what he thought they wanted to hear - perhaps a hallmark of a corrupt politician. This gave him a lot of freedom to play both sides. Liberals literally thought he was liberal and conversatives thought he was conservative. Not the most moral of stances, but in that pre-internet age, more possible to pull off and even smart tactically. \n \"Once, a congressional aide, who had just heard him \"talking conservative\" with Martin Dies, came across him, \"not an hour later,\" \"talking liberal\" with Patman-- espousing a point of view diametrically opposite to the one he had been espousing sixty minutes before.\" \n A hallmark of the New Deal was helping people who needed it, and Johnson did help the poor farmers of Texas. I thought this quote was a powerful representation of the impact he had and why he kept getting elected: \n \"Oh my God,\" her mother said. \"The house is on fire!\" But as they got closer, they saw the light wasn't fire. \"No, Mama,\" Evelyn said. \"The lights are on.\" They were on all over the Hill Country. \"And all over the Hill Country,\" Stella Gliddon says, \"people began to name their kids for Lyndon Johnson.\"", "date_added": "Mon Sep 26 08:45:50 -0700 2016", "date_updated": "Wed Jan 04 01:26:15 -0800 2017", "read_at": "Fri Nov 18 00:00:00 -0800 2016", "started_at": "Mon Sep 26 00:00:00 -0700 2016", "n_votes": 6, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "28119237", "review_id": "7a8dc8ab7f3c0084be8150d7e5bd40cb", "rating": 4, "review_text": "A fascinating book about community and belonging, and how modern society has moved us away from our roots in potentially signifiant ways. The book opens with a thought provoking fact: in early America, there were numerous instances of white people joining primitive, native Indian societies - but zero instances of the opposite, because \"the intensely communal nature of an Indian tribe held an appeal that the material benefits of Western civilization couldn't necessarily compete with.\" \n The book also argues that the wealth we enjoy in modern society is isolating, against the grain of millions of years of our evolution, and can lead to depression, because our happiness is in large part rooted in a need to feel connected to others. While this feels right and intuitive, it doesn't seem to be the way we are optimizing our lives. \n \"A wealthy person who has never had to rely on help and resources from his community is leading a privileged life that falls way outside more than a million years of human experience. Financial independence can lead to isolation, and isolation can put people at a greatly increased risk of depression and suicide. This might be a fair trade for a generally wealthier society-- but a trade it is.\" \n Another loss the book points out is the loss of the transparency and social justice that being in a small community used to bring. When your neighbors and community members all know each other and what is going on with each other, group peer pressure tends to reward good actions and punish bad ones. The book points out that people wouldn't for instance cheat unemployment if their neighbors were paying for it and everyone knew what was happening. In anonymity we have lost a sense of responsibility to each other. \n Another data point about the power of human connection that a disaster, such as a war, can bring to a society. Junger talked about this in a recent guest post on the Goodreads blog, saying \"Time and time again in history, civilians have forged incredibly strong bonds in the face of wars and earthquakes and floods and gone on to miss those heady times of cooperation. Also demonstrating the power of bonding is the fact that one of the most devastating thing a soldier can face is the loss of a buddy. \"Interestingly, a strong bonding experience can also lead to social change - for instance: \"The coming-together that societies often experience during catastrophes is usually temporary, but sometimes the effect can last years or even decades. British historians have linked the hardships of the Blitz-- and the social unity that followed-- to a landslide vote that brought the Labour Party into power in 1945 and eventually gave the United Kingdom national health care and a strong welfare state.\" \n The book basically concludes that the largest cost or risk of modern society is the loss of community. This is something worth giving a lot of thought in terms of our priorities.", "date_added": "Thu Sep 22 16:19:12 -0700 2016", "date_updated": "Thu Sep 22 16:19:12 -0700 2016", "read_at": "Tue Nov 22 00:00:00 -0800 2016", "started_at": "", "n_votes": 30, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "30282601", "review_id": "251f22b7a1f6f45c4affa58cb93ac095", "rating": 4, "review_text": "My first Scalzi book - and really enjoyed it. Delightful well written science fiction book set in the future in a time when humanity is spread out across space and can travel between planets using \"the flow\". \n I liked how this universe was entirely designed around one huge natural resource (the flow). The entire balance of power was created because the people who controlled the most valuable planet (Hub) started out as armed toll collectors. And from there they shared power with anyone who could contest them, and thus created lots of other Houses and Guilds. With this power dynamic established, the book then delves into the question of what happens if the main natural resource should change. \n One other thing that I liked even though it was minor to the book was how the emperox's all had all themselves recorded for their entire lives - all neurological happenings in their brains. This lets you create an AI against that dataset that let's you sort of recreate their personality. This idea is interesting, though I think if it did exist it would be much more transformative than it was represented in the book. However makes you wonder if people aren't already starting to do things like this.", "date_added": "Wed May 25 14:27:12 -0700 2016", "date_updated": "Sat Jun 10 10:30:38 -0700 2017", "read_at": "Sun Apr 30 19:26:23 -0700 2017", "started_at": "Mon Apr 17 12:50:10 -0700 2017", "n_votes": 18, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "20873740", "review_id": "ef77b0cd7d5db0a85aa64f291d63d450", "rating": 5, "review_text": "I haven't read a ton of \"history of the world\" books, but this was fascinating. Highly recommended. I think the author is incredibly good at explaining and simplifying big concepts. He take on complex things like religion & capitalism and explains them in very simple terms that you likely hadn't thought about before. \n The history of religion chapter was very interesting. I hadn't thought about the fact that many early religions were animists or polytheists, or dualists. Nor the fact that they all sort of merged into todays concepts: \n \"monotheism, as it has played out in history, is a kaleidoscope of monotheist, dualist, polytheist and animist legacies, jumbling together under a single divine umbrella. The average Christian believes in the monotheist God, but also in the dualist Devil, in polytheist saints, and in animist ghosts.\" \n There was a fascinating bit on the scientific mindset, and how it was key to Europe taking power. After the scientific revolution, they believed in science and its ability to let man discover new things, make more money, etc. This made them into explorers, whereas many other cultures remained very static. Great example of China having had gunpowder for hundreds of years but not using it for anything other than fireworks, and didn't invent the gun. Reminded me a bit of the Mindset. \n The chapter on capitalism was fascinating. There line about before its invention that the economy didn't grow, and was \"frozen\" as nobody poured money into new things, so there was no growth. Then the notion of credit was discovered, and as growth started, the combination snowballed. In 1500 the annual per capita production was $550 and today its $8,800 - this is an astounding increase, and all because of the virtuous growth cycle of capitalism: money is invested -> businesses grow -> people make money -> they invest their money. I never thought about the fact that reinvesting profits is a core piece of capitalism, but from this lens it really is. \n \"The human economy has nevertheless managed to keep on growing throughout the modern era, thanks only to the fact that scientists come up with another discovery or gadget every few years - such as the continent of America, the internal combustion engine, or genetically engineered sheep.\" \n What I didn't see coming is how the end of the book was dedicated to human happiness. Fascinating questions to ask if we are happier today than 1,000 or 2,000 years ago. By metrics of death rate, average age of death and general health, we ought to be. But clearly peasants after the agricultural revolution were on average less happy than they were before as hunter-gatherers. And now we live in an always-on internet age, with pressure to continue growing our economy. So are we happier? It is the right question, in my opinion. The book then gave the basics of the happiness framework that I've also read in other places and believe in: that people are happy when they have 3 things: (1) Friends and family that love them (2) Are part of a community that makes them feel like they below (3) have a purpose to their life and feel like they are doing something meaningful. However, the book then adds onto this in another way that I have been learning about but hadn't put together with this: meditation. \n \"According to Buddhism, the root of suffering is neither the feeling of pain nor of sadness nor even of meaninglessness. Rather, the real root of suffering is this never-ending and pointless pursuit of ephemeral feelings, which causes us to be in a constant state of tension, restlessness and dissatisfaction. Due to this pursuit, the mind is never satisfied. Even when experiencing pleasure, it is not content, because it fears this feeling might soon disappear, and craves that this feeling should stay and intensify. People are liberated from suffering not when they experience this or that fleeting pleasure, but rather when they understand the impermanent nature of all their feelings, and stop craving them. This is the aim of Buddhist meditation practices.\" \n So the moral of the book is basically that we should all meditate a lot, stop worrying, and be happy with what we have.", "date_added": "Tue May 17 20:59:38 -0700 2016", "date_updated": "Tue May 17 20:59:38 -0700 2016", "read_at": "Sat Aug 13 00:00:00 -0700 2016", "started_at": "Fri Jul 01 00:00:00 -0700 2016", "n_votes": 68, "n_comments": 5}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "25884323", "review_id": "332732725863131279a8e345b63ac33e", "rating": 4, "review_text": "I really enjoyed this book, and there is a lot to recommend it. It did drag on a little at the end so I knocked off 1 star - but overall a wow book. \n It's the story of a starship sent to Tau Ceti - the nearest star that has Earth analog planets - to colonize it. The journey there will take generations, and the story is told of the 3rd & 4th (?) generations, which are the ones that reaches Tau Ceti. It is a story of purpose, and how having a purpose affects behavior. A story of politics, and people. \n The first cool thing about this book is the richness of its world. The ship is intricate and large in its design and ambition to shepherd ~1200 people for that much time. It had 3D printers that can print almost anything you can imagine - even DNA - or more printers - so little goes lacking that can't be recreated. \n But the thing that makes this book brilliant is the Ship. The AI that controls the ship, who is narrating the book by the end. It's observations about humans and our language are just brilliant. It starts with the astute observation that human language is very imprecise, and relies heavily on metaphor and analogy. It is remarkable once you start to reflect on it, how true that is. To hear the AI reflect on this: \n \"Perhaps there is a provisional solution to this epistemological mess, which is to be located in the phrase \"it is as if\". This phrase is of course precisely the announcement of an analogy. And on reflection, it is admittedly a halting problem, but jumping out of it, there is something quite suggestive and powerful in this formulation, something very specifically human. Possibly this formulation itself is the deep diagnostic of all human cognition--the tell, as they say, meaning the thing that tells, the giveaway. In the infinite black space of ignorance, it is as if stands as the basic operation of cognition, the mark perhaps of consciousness itself. Human language: it is as if it made sense.\" \n Basically we are a bunch of pattern matchers, trying to match things we've seen before to new things, and if they don't match perfectly, it doesn't matter, because matching helps us bucket and organize the new information. But this is incredibly fuzzy! The AI also makes hilarious observations like this: \n Indeed, it has to be said that the percentage of old human sayings and proverbs that are actually true is very far from 100 percent. Seems it may be less important that it be true than that it rhyme, or show alliteration or the like. What goes around comes around: really? What does this mean?\" \n Or this, as it analyzes chatter from Earth: \"It was a whiny culture, we were finding.\" \n Listening to the AI try to reason is also very interesting to my programmers mind. I especially loved it's discussion of the meaning of life - it really nails it. If a program (or a person) has no objective, it has no purpose, no meaning, no organizing principle, and it's existence will be in trouble. But if you have that meaning to organize your thoughts & actions - or your subroutines - than you have a purpose. Meaning is the hard problem indeed. \n \"We had a project on this trip back to the solar system, and that project was a labor of love. It absorbed all our operations entirely. It gave a meaning to our existence. And this is a very great gift; this, in the end, is what we think love gives, which is to say meaning. Because there is no very obvious meaning to be found in the universe, as far as we can tell. But a consciousness that cannot discern a meaning in existence is in trouble, very deep trouble, for at that point there is no organizing principle, no end to the halting problems, no reason to live, no love to be found. No: meaning is the hard problem.\" \n My review focuses a lot on the AI, but that's not the main thrust of the book. The war between stayers and leavers, the political tensions, the slinghot maneuvers to get back - all make the book worth reading. And as a surfer, I love how it ends with Freya finding meaning in surfing waves.", "date_added": "Mon Apr 25 09:31:23 -0700 2016", "date_updated": "Mon Apr 25 09:31:23 -0700 2016", "read_at": "Sun Jun 26 00:00:00 -0700 2016", "started_at": "Sat May 28 00:00:00 -0700 2016", "n_votes": 9, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "19398490", "review_id": "ea4a220b10e6b5c796dae0e3b970aff1", "rating": 4, "review_text": "A beautiful story. It is rare to encounter a book that does such a good job painting the scenes in your mind - you really felt like you were there and got to know the characters and the people they came across. I generally love WWII books and movies, but wasn't sure if I'd like one featuring a blind girl and a young Nazi radio operator - but he brings a lot of life to them. \n That said, the novel drifts around a lot, and the plotline jumping forward and backward in time drove me nuts. \n I thought a lot about if there is a theme to the book. One was the diamond and if it was really cursed (based on the Hope Diamond perhaps?). Another is that 20K Leagues is an awesome book. But I think the book was a lot about fear and the unknown, and how people deal with it. Marie-Laure was blind and couldn't tell what was happening around her - yet she was the bravest one. Werner was afraid of ending up as a miner, which drove him to join the army, and learn about radios. And Uncle Etienne was afraid dying from a sniper he couldn't see, so he didn't leave his house and he created a radio transmitter. So the moral of the story is... don't be paralyzed by your fears. \n This, she realizes, is the basis of his fear, all fear. That a light you are powerless to stop will turn on you and usher a bullet to its mark.\"", "date_added": "Sun Jan 03 21:20:46 -0800 2016", "date_updated": "Tue Sep 20 23:30:15 -0700 2016", "read_at": "Tue Sep 13 11:51:51 -0700 2016", "started_at": "Sat Aug 20 07:03:03 -0700 2016", "n_votes": 35, "n_comments": 5}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "23310161", "review_id": "f4b4b050f4be00e9283c92a814af2670", "rating": 4, "review_text": "Fun sequel to the original.", "date_added": "Tue Nov 17 11:37:35 -0800 2015", "date_updated": "Tue Nov 17 11:38:05 -0800 2015", "read_at": "", "started_at": "", "n_votes": 7, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "18662473", "review_id": "d32b880c4cc3bd721eb9feb16bd91297", "rating": 5, "review_text": "If everyone in the world read this book, the world would instantly become a better place. Mental models, while never perfect, are very powerful tools, and Grant has come up with a compelling, research backed view of what makes some people successful, and others less so. \n Grant divided the world into givers, matchers, and takers. Through a lot of research, Grant determined that the most successful and the least successful people are often givers, that takers often do well but not over the long term, and the vast majority of people are matchers. Like all such categorizations (eg fixed vs growth mindset), it isn't perfect, which bothered me a little - until you realize that in different situations you can either be giving, taking, or matching, and there are probably people that favor one of those three more often than not. \n Grant used surveys to determine if people are givers, though its strange that he didn't expand on what type of questions are used to determine this, as it would have been insightful. Happily, Google works, and I found he does have such a test on his website. And I scored 53% giver! \n The book opens with a chapter about one of the best givers and people that I know, David Hornik, who funded the last company I worked at. So awesome to see him getting such an amazing shoutout - he deserves it! \n I liked the example of Ken Lay as a successful taker. \"When kissing up, takers are often good fakers.\" I do wonder how many successful \"takers\" there are out there that don't have anything bad happen to them though. The book does use Frank Lloyd Wright as such an example, which is a fascinating dichotomy. \n Other interesting ways to determine givers & takers: use of \"I\" vs \"we\", number of LinkedIn \n recommendations written vs received. \n This was a very powerful insight: \"people actually make more accurate and creative decisions when they're choosing on behalf of others than themselves.\". Eg: \"The solution was thinking about myself as an agent, an advocate for my family. As a giver, I feel guilty about pushing too much, but the minute I start thinking, 'I'm hurting my family, who's depending on me for this,' I don't feel guilty about pushing for that side.\" \n The book also explains why givers are also the most unsuccessful - they are too selfless. Successful givers balance giving to others while taking care of themselves. \"As Bill Gates argued at the World Economic Forum, \"there are two great forces of human nature: self-interest, and caring for others,\" and people are most successful when they are driven by a \"hybrid engine\" of the two. If takers are selfish and failed givers are selfless, successful givers are otherish: they care about benefiting others, but they also have ambitious goals for advancing their own interests.\" \n I liked the example of how with Freecycle, small numbers of givers could turn everyone into givers. I think Goodreads has had a similar journey with our community. It's kind of the definition of a community: \"If a group develops a norm of giving, members will uphold the norm and give, even if they're more inclined to be takers or matchers elsewhere. This reduces the risks of giving: when everyone contributes, the pie is larger, and givers are no longer stuck contributing far more than they get.\" \n Some other quotes I liked: \n \"highly talented people tend to make others jealous, placing themselves at risk of being disliked, resented, ostracized, and undermined. But if these talented people are also givers, they no longer have a target on their backs.\" \n \"For many years, psychologists believed that in any domain, success depended on talent first and motivation second. To groom world-class athletes and musicians, experts looked for people with the right raw abilities, and then sought to motivate them. If you want to find people who can dunk like Michael Jordan or play piano like Beethoven, it's only natural to start by screening candidates for leaping ability and an ear for music. But in recent years, psychologists have come to believe that this approach may be backward. In the 1960s, a pioneering psychologist named Raymond Cattell developed an investment theory of intelligence. He proposed that interest is what drives people to invest their time and energy in developing particular skills and bases of knowledge. Today, we have compelling evidence that interest precedes the development of talent. It turns out that motivation is the reason that people develop talent in the first place.\"", "date_added": "Fri Nov 06 13:46:09 -0800 2015", "date_updated": "Mon Mar 27 12:12:04 -0700 2017", "read_at": "Tue Jan 10 00:00:00 -0800 2017", "started_at": "Sun Dec 18 00:00:00 -0800 2016", "n_votes": 29, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "10405048", "review_id": "c236af7479f1e87f56c7202016f624b3", "rating": 4, "review_text": "I kind of loved this book because it give a lot of the \"why\" - the science - behind a lot of best practices. This is the kind of thing that helps me change my behavior - when I know how it works under the hood. \n The book is broken into a series of \"brain rules\" on different subjects. I'll list main takeaways: \n Exercise \n We all know it's good for us and it feels good and we should do it. The best quote here was \"Physical activity is cognitive candy.\" - also \"A lifetime of exercise results in a sometimes astonishing elevation in cognitive performance, compared with those who are sedentary.\" The basic science is that blood flow through your brain is good for it and increases brain activity. Tip: exercise before you need your brain to be at its best. \n Sleep \n First, great to have validation that there really are early birds and night owls. I'm definitely a night owl, despite my kids best efforts. The interesting implications of this for a company are that people are at their best - their most productive - at different times of the day - so building a culture that is flexible and let's people work their hours is key. The science about the history of naps and the fact that the mid-afternoon slump is a real thing was also very interesting. The studies about sleep loss being as cognitively limiting as alcohol were also illuminating. Another study showed sleeping on a problem really does work. \n But the most interesting thing about the sleep chapter was the section on dreaming and what it might mean. In particular, dreams may at least in large part be a method of neural network training to enforce learning. \"humans appear to replay certain learning experiences at night, during the slow-wave phase.\" \n Stress \n Too much stress is bad for you - our systems weren't designed for constant stress. If you have too much adreline in your system constantly it leads to scarred blood vessels and then eventually a stroke. But a little stress is good - our brains will remember things that we are stressed about better (eg avoid predators on the savannah). But too much (chronic) stress can overwhelms the brain and hurts learning and can even make you depressed. Chronic stress is often the culprit in grief, or high anxiety households. The worst kind of stress is the feeling that you have no control over the problem-- you are helpless. \n Wiring \n \"What you do and learn in life physically changes what your brain looks like-- it literally rewires it.\" \n Attention \n I've said for a long time that humans don't remember facts, we remember facts couched in emotions. We can easily recall all the strong emotional moments of our lives as if they happened yesterday. Now it's great to have the science behind this: emotions release dopamine, which greatly aids in memory and information processing. This means that people will relate better to products that bring up positive emotions for them. It also means that an emotional hook to lead into an idea or product will always work as it triggers the emotion in the person. \n \"Emotionally charged events are better remembered--for longer, and with more accuracy--than neutral events.\" \n Another interesting thing mentioned in this chapter is the 10 minute rule. We only have about 10 minutes of attention on something before we start to tune out. As the book says, \"This fact suggests a teaching and business imperative: Find a way to get and hold somebody's attention for 10 minutes, then do it again.\" \n To get an idea to stick you have to give people the mental model for it first - \"meaning before details\". Specifically, you need to: \"Give the general idea first, before diving into details, and you will see a 40 percent improvement in understanding.\" And then you also have to simplify and hammer home concepts and let people digest them - force-feeding too many concepts at once won't sink in. \n In terms of paying attention (vs automatic things like riding a bicycle), \"Multitasking, when it comes to paying attention, is a myth.\" - the brain can only pay attention to one thing at a time. \n Memory \n There are different types of memory: declarative (I can remember my address and SSN), non declarative (I can remember how to ride a bike), short term, and long term. Short term memory isn't converted to long term easily: \"People usually forget 90 percent of what they learn in a class within 30 days. And the majority of this forgetting occurs within the first few hours after class.\". Keys to doing so are coding in emotion (why word association works), and repetition (\"repeat to remember\"). Also, thinking about what tree the person will mentally group the information and how to increase entry points or create strong ones. \n Interestingly, \"Memory worked best, it appeared, if the environmental conditions at retrieval mimicked the environmental conditions at encoding.\". This means if you learn something sad you will remember it better if you get sad again. Fascinating. This makes sense, as our brains must group similar patterns it remembers together. To get practical, you can create science, art, language stations to help people remember better. \n We all know this to be true - our memory isn't perfect. This is because we remember patterns, not facts or single instances. \"Our brains give us only an approximate view of reality, because they mix new knowledge with past memories and store them together as one.\" \n Another tidbit I liked, that fits in the \"repeat to remember\" bucket: \"A great deal of research shows that thinking or talking about an event immediately after it has occurred enhances memory for that event\". Basically the more an idea can be repeated - especially in timed intervals - the more chance it has of being encoded from short term to long term memory. \n Sensory Integration \n We remember data from each of our senses, and we learn best if we stimulate multiple senses concurrently. You remember better if you see AND hear something, or even if given words and pictures. Smells or sounds or tastes can trigger additional associations or emotions and help us create positive or negative associations to things we see or do. This is why people who haven't adopted digital reading say things like \"I love the smell of a good book\", this is why smelling fresh roasted coffee is a key part of Starbucks playbook. Smells have the power to bring back memories that are associated with them. \n Vision \n Vision trumps and overrides all other senses. I loved the story about the wine experts who were fooled by white wine with red dye in it because their eyes said it was red wine. Fascinating to read about the science of how the brain takes in the signals from the eyes, combines both signals, and applies pattern matching to fill in details. This means the brain has creative freedom to insert whatever it wants into our vision. \n Practical applications: our vision is caught by bold colors, orientations, motion. We remember images better than words because it's easier to pattern match the image, so use images in presentations. \n Music \n Music makes us more empathic - we can better recognize the emotions in speech, which helps in social abilities. Making music is 10x better for kids than listening to baby einstein CD's. Listening to music reduced cortisol and stress. \n Gender \n Boys and girls have different brain structures. When under stress, men remember the gist of things better, and women remember details and emotions. These quotes describe it well: \n \"The difference between girls' and boys' communication could be described as the addition of a single powerful word. Boys might say, \"Do this.\" Girls would say, \"Let's do this.\" \n \"When girl best friends communicate with each other, they lean in, maintain eye contact, and do a lot of talking. They use their sophisticated verbal talents to cement their relationships. Boys never do this. They rarely face each other directly, preferring either parallel or oblique angles. They make little eye contact, their gaze always casting about the room. They do not use verbal information to cement their relationships. Instead, commotion seems to be the central currency of a little boy's social economy. Doing things physically together is the glue that cements their relationships.\" \n \"In our evolutionary history, having a team that could understand both the gist and details of a given stressful situation helped us conquer the world. Why would the world of business be exempted from that advantage? Having an executive team or work group capable of simultaneously understanding both the emotional forests and the trees of a stressful project, such as a merger, might be a marriage made in business heaven. It could even affect the bottom line.\" \n Exploration \n We learn by doing, by exploring the world. We take pleasure in that exploration. Discovery based learning is best. Medical school offers the best on the job learning - other types of education should do better to model it. Learn and be curious.", "date_added": "Wed Oct 28 10:36:49 -0700 2015", "date_updated": "Wed Oct 28 10:36:49 -0700 2015", "read_at": "Wed Jun 15 00:00:00 -0700 2016", "started_at": "Tue Mar 29 00:00:00 -0700 2016", "n_votes": 38, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "22875447", "review_id": "071dc23c5f6dac171554033d84750bd8", "rating": 5, "review_text": "I think this is a must read for any leader in a modern business. Google has done a lot of things right both in their products and also in how they run their company and build their culture, and this is a fairly detailed account of how they've built an impressive culture, and is written by someone who knows - their head of HR. I'm a little surprised he told as much as he did - but I suppose it will only help for recruiting. \n Goodreads is now a subsidiary of Amazon, and I have spent significant time learning to integrate the best of Amazons culture with ours. And I'm happy to say that many - perhaps most - of the best practices listed in the book are also used by Amazon. Things like hiring people smarter than you, hiring committees and having objective people on them, committees to approve promotions, focusing on the two tails, and more. These don't seem to be things all companies do yet - but should. \n So while much of the practices were things I'm already doing or aware of - there was a lot I learned from the book too. Here are some of the bigger takeaways I had. \n One of the more interesting ones was the notion to separate performance reviews from compensation discussions. This makes a lot of sense, is something we have already been making progress towards, and is something I'm going to think about more. \n \"Traditional performance management systems make a big mistake. They combine two things that should be completely separate: performance evaluation and people development. Evaluation is necessary to distribute finite resources, like salary increases or bonus dollars. Development is just as necessary so people grow and improve.\" If you want people to grow, don't have those two conversations at the same time. Make development a constant back-and-forth between you and your team members, rather than a year-end surprise.\" \n Another one was giving managers a bi-annual scorecards from their directs on how they did on ~10 dimensions that Google has determined are the determinants of a great manager. And no surprise (but very important to keep in mind), the book found that \"manager quality was the single best predictor of whether employees would stay or leave, supporting the adage that people don't quit companies, they quit bad managers.\" While we do a lot of surveys, we haven't packaged up the managers feedback into a report like this, and I think that would be powerful. \n Laszlo was impressive in citing lots of research to prove his points. It was one of my more favorite things about the book - he is clearly a student of human development. This led to lots of tidbits that apply pretty broadly, and which are great things to keep in mind when building a business. \n The chapter on nudges was I think my favorite in the book. Pretty cool the depth to which they have taken these - reminds me a lot of the onboarding funnel analysis I've done for Goodreads - paying attention to where you can message timely, relevant, easily actionable messages that will result in people taking desired actions, and a/b testing the results. Pretty impressive they a/b test that kind of stuff at Google! Examples given were around lists on how to onboard someone as a manager, how to be onboarded as a newbie, how to get more people to save money earlier in life and enroll in the 401K program (his data here was impressive - on how people of the same income bracket vary widely on wealth accumulated in their lives based purely on how much they save when they are young), and how to get people to eat healthier by putting the healthier foods in the kitchens more prominently. \n \"Nudges are an incredibly powerful mechanism for improving teams and organizations. They are also ideally suited to experimentation, so can be tested on smaller populations to fine-tune their results.\" \n Laszlo did a great job of explaining a lot of the psychology behind nudges too. My favorite was the research about checklists, and story about how the Airforce found that even the smartest, best trained pilots can make mistakes, but having checklists reduces their error rates significantly. \n \"I realized that management too is phenomenally complex. It's a lot to ask of any leader to be a product visionary or a financial genius or a marketing wizard as well as an inspiring manager. But if we could reduce good management to a checklist, we wouldn't need to invest millions of dollars in training, or try to convince people why one style of leadership is better than another. We wouldn't have to change who they were. We could just change how they behave.\" \n \"It turns out checklists really do work, even when the list is almost patronizingly simple. We're human, and we sometimes forget the most basic things.\" \n Another thing I loved was the focus on identifying the people who are best at a specific skill, and designing a program for them to teach that skill to others. G2G (Googlers 2 Googlers). \n \"Giving employees the opportunity to teach gives them purpose. Even if they don't find meaning in their regular jobs, passing on knowledge is both inspiring and inspirational.\" \n I liked his descriptions of deliberate learning. He gave examples of asking after every meeting \"what did we learn and how could we do better in the future\". And the story about Tiger hitting golf balls at 4am in the rain was pretty sweet. \n \"Ericsson refers to this as deliberate practice: intentional repetitions of similar, small tasks with immediate feedback, correction, and experimentation.\" \n My favorite tidbit - which I know to be true but is something great to keep in mind - is how to motivate people: let them connect to the people their work is helping. \n \"even a small connection to the people who benefit from your work not only improves productivity, it also makes people happier. And everyone wants their work to have purpose. \n Bock, Laszlo (2015-04-07). Work Rules!: Insights from Inside Google That Will Transform How You Live and Lead (pp. 340-341). Grand Central Publishing. Kindle Edition.", "date_added": "Thu Oct 01 22:11:41 -0700 2015", "date_updated": "Wed Mar 22 11:47:41 -0700 2017", "read_at": "Sun Dec 27 00:00:00 -0800 2015", "started_at": "Wed Nov 25 00:00:00 -0800 2015", "n_votes": 36, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "4866", "review_id": "6136a87d1b3f2156c19b9d27592eeec3", "rating": 0, "review_text": "https://brianjohnson.me/philosophers-...", "date_added": "Tue Aug 18 20:54:10 -0700 2015", "date_updated": "Tue Aug 18 20:58:43 -0700 2015", "read_at": "", "started_at": "", "n_votes": 4, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "23158207", "review_id": "ba0435b24656859d21e413868358e6f5", "rating": 3, "review_text": "A decent book about Google from it's former CEO and head of product. I am only giving it 3 stars because a lot of it was too vague to be useful or stuff I already knew. However every 5 or 10 pages there was a nugget, or reminder of something I knew but that was good to think about. Also good to see a lot of this all written down in one place. So worthwhile overall, though it did take me a while to plow through. \n Eric spent a lot of time talking about product excellence. In todays crowded market, products that are better than the rest are the ones that succeed. Better design, functionality, even speed. \n \"product excellence is now paramount to business success--not control of information, not a stranglehold on distribution, not overwhelming marketing power\" \n There was also a lot of discussion about how to lead a engineering and product led organization - which is absolutely critical in a technology company. Also discussion how to scale a company and hire smart people. Eric used the prhase \"smart creatives\" to describe the kind of people who will be successful in a technology company - though I'm not so sure they are such a new breed as he makes out. But anyways: identify smart creative people who like tech. Then find those who have the biggest impact and give them more to do, and lots of autonomy. \n The below was another obvious-yet-interesting-to-think about philosophy of Google's. A good question to ask in any new product or feature is always what technical innovation it has. \n \"Basing products on technical insights has always been a core principle of Google, but its importance became even more clear to us in 2009, when we reviewed our product line and started to see a pattern emerging: The best products had achieved their success based on technical factors, not business ones, whereas the less stellar ones lacked technical distinction.\" \n This is another quote that I think is a key to success and scaling a company: \n \"The simple way to keep recruiting in everyone's job description is to measure it. Count referrals and interviews. Measure how quickly people fill out interview feedback forms. Encourage employees to help with recruiting events, and track how often they do. Then make these metrics count when it comes to performance reviews and promotions. Recruiting is everyone's job, so grade it that way.\" \n Other good tips: \n * keep details about projects people are doing in your phone address book so you can easily look them up anywhere. \n * Once a year write a self-review and share it with the people you work with. \n * Clean out your inbox down to 5 emails or less each day. \n * In a fast paced business the best/only way to get things done is relationships, so pay attention to those. \n * OKR's and why it's good to stretch yourself, and make them public. \n * 70/20/10 for resource allocation: 70% on the core business, 20% on emerging, 10% on new. \n * The way to improve a product is to challenge your smart people. Eg \"these ads suck\"", "date_added": "Wed Jul 29 06:36:19 -0700 2015", "date_updated": "Wed Dec 14 12:30:43 -0800 2016", "read_at": "Sun Sep 27 00:00:00 -0700 2015", "started_at": "Thu Aug 13 00:00:00 -0700 2015", "n_votes": 25, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "22318578", "review_id": "5fe9882bfe4b0520a322820c4c55747d", "rating": 5, "review_text": "5 stars for giving me a better framework for how to organize my stuff and what stuff to keep than I'd ever had before. For instance it was so freeing to realize I don't have to keep gifts.", "date_added": "Sun Jun 07 12:50:13 -0700 2015", "date_updated": "Wed Mar 22 11:36:58 -0700 2017", "read_at": "Sun Aug 09 00:00:00 -0700 2015", "started_at": "Sun Jun 07 00:00:00 -0700 2015", "n_votes": 24, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "24189224", "review_id": "dbc01e2438df7a87ee3dc16ee23a53e5", "rating": 0, "review_text": "Numerous people in publishing have told me this will be the book of the year.", "date_added": "Fri May 29 17:48:57 -0700 2015", "date_updated": "Fri May 29 17:49:40 -0700 2015", "read_at": "", "started_at": "", "n_votes": 11, "n_comments": 5}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "22551730", "review_id": "754710070f38e1c59a45f6a85473b836", "rating": 4, "review_text": "Another hard to put down nonfiction book from Erik Larson. I really enjoyed this book - mostly to learn more about submarine warfare in WWI, but also to learn about the history of the time. How America entered the war, the importance of shipping to England, the ruthlessness and autonomy of German u-boat commanders. Larson also did a great job of layering in interesting historical info (though he overdid it too a little bit). \n One of the dramas of the story of the Lusitania that Larson focuses on is if the British wanted the Lusitania to be sunk, to help draw America into the war. His conclusion seems to be that was the case, though there isn't conclusive evidence. Before the Lusitania sank, very few Americans had died in the war, and there were hundreds of Americans on the boat when it sank, which definitely helped change America's attitude. And even then, it took 2 years after it sank for America's troops to arrive. \n \"the most likely explanation is that there was indeed a plot, however imperfect, to endanger the Lusitania in order to involve the United States in the war.\" \n Some of my favorite details from the book were simply about what it took to navigate a u-boat in WW1. For instance: \n \"In this day before sonar, a submarine traveled utterly blind, trusting entirely in the accuracy of sea charts. One great fear of all U-boat men was that a half-sunk derelict or an uncharted rock might lie in their path.\" \n Which is crazy! Plus, the torpedoes weigh 3 thousand pounds each, so a boat could only carry ~7, and their failure rate was something like 60%. Also, they had limited fuel and operated only on batteries when submerged so they could only stay underwater for limited amounts of time. Given all this, trying to operate a u-boat to sink other boats is a pretty dangerous sounding game of chess. But they certainly had an effect on the war - at one point Britain estimated it would have to surrender in 3 months if it didn't get more supplies. \n There were a lot of interesting details from the era that Larson wove in that was interesting as well. Stuff like the fact that Ouija boards were commonplace in American households, straw hat day. \n My main critique is that it had a few too many irrelevant details - about various passengers or what happened the day the boat left dock - and stuff like that - felt a bit padded in that respect. But overall, a great read.", "date_added": "Thu May 07 13:59:32 -0700 2015", "date_updated": "Wed Dec 14 12:30:43 -0800 2016", "read_at": "Sat Jul 11 00:00:00 -0700 2015", "started_at": "Wed Jun 24 00:00:00 -0700 2015", "n_votes": 20, "n_comments": 6}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "22816087", "review_id": "d11954e6e9e9ddf52aed41d83ce43fa6", "rating": 5, "review_text": "I love Stephenson - and this was another hit - absolutely loved it. The great thing about a good Stephenson book is it makes you think about the future in new ways, and this book was no exception. \n It was really two books, and I certainly didn't see the second one coming. It starts out in modern times and then someone blows up the moon. We don't have time to find out who, as within a few years the fragments of the moon cause the worst asteriod shower earth has ever seen and wipe out all life in earth. We have time to send 1,500 people up into space - and this is their story. \n The use of robots throughout the books was fascinating to me. Stephenson has clearly looked 10-20 years into our future and correctly predicted how it will go. From robot workers in space, nano-bots, nano-robot weapons, and more - we get a vivid portrayal of how robots might be a part of our future lives. \n I thought the focus on use of whip technology in space was interesting. And of course, the whole notion of Cradle was just cool - though not sure about it's feasibility.", "date_added": "Wed Apr 29 10:56:44 -0700 2015", "date_updated": "Wed Dec 14 12:30:43 -0800 2016", "read_at": "Wed Nov 04 00:00:00 -0800 2015", "started_at": "Sun Sep 27 00:00:00 -0700 2015", "n_votes": 40, "n_comments": 6}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "9151181", "review_id": "179fb81e156512bcb3baa3d930bc10bf", "rating": 3, "review_text": "An interesting book that describes Howards return to CEO and the challenges of getting Starbucks back on track after massive scaling and the economic downturn of 2008 left it in a vulnerable position. \n Howard comes across as someone that loves Starbucks - the company he created. His passion for innovation and coffee and making it work are infectious, and learning a little about his leadership style was very interesting. I particularly enjoyed his descriptions of how Starbucks went astray as it had scaled to over 20 thousand stores, and how he tackled bringing it back. \"The Transformation Agenda\" - because sometimes if you give change a name people will believe it's coming. \n I enjoyed reading about the campaign to close all Starbucks stores to let employees watch a training video. A big statement, one that was very public, and acknowledged they knew they had issues they need to improve. Bold move, and a respected one. \n My only criticism of the book is that it comes across as a lot of corporate speak. I'm not saying it's inauthentic, just that the kind of language that he needs to motivate his employees is likely different what what he needed to put in this book. But he's clearly an inspirational leader. \n Howard spent a lot of time focused creating a quality experience for his customers. He realized that every piece of the Starbucks experience was crucial to building a top tier brand that stood for quality and a place that people would want to spend time at. From the smell of coffee in the store (and the related battle to have or not have cheese sandwiches), to choices people have, to the interactions with the baristas. The baristas were crucial, because with over 20 thousand stores, he had to create programs to train them and make sure they had the right values and approach. \n I still love my Blue Bottle, but I have more respect when I walk into a Starbucks store now.", "date_added": "Sun Mar 08 21:42:32 -0700 2015", "date_updated": "Wed Mar 22 11:36:55 -0700 2017", "read_at": "Thu May 28 00:00:00 -0700 2015", "started_at": "Mon Mar 23 00:00:00 -0700 2015", "n_votes": 8, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "17290220", "review_id": "22d424a2b0057b18fb6ecf017af7be92", "rating": 5, "review_text": "One of my favorite books to read to my 5 year old. Rosie learns to have grit and become an engineer! #fathersdream", "date_added": "Sat Nov 08 08:54:03 -0800 2014", "date_updated": "Wed Jan 25 13:56:12 -0800 2017", "read_at": "Tue Jan 24 00:00:00 -0800 2017", "started_at": "", "n_votes": 4, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "6954929", "review_id": "50ed4431c451d5677d98dd25ca8ec106", "rating": 5, "review_text": "One of the best and most imaginative childrens books I've ever read. Isadora loves it.", "date_added": "Thu Oct 23 13:46:20 -0700 2014", "date_updated": "Thu Oct 23 13:47:00 -0700 2014", "read_at": "", "started_at": "", "n_votes": 6, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "18176747", "review_id": "64d7bf6a10f610d8dc6ff377ad04e84d", "rating": 5, "review_text": "I haven't read many (any?) books that are written by CEO's for CEO's. If you are a CEO, aspire to be a CEO, or really, manage anyone - you need to read this book. \n This quote is perhaps my favorite one from the book. At the top, nobody is there to tell you what to do. It's easy to look at some leaders and wonder how they knew what to do to become so successful. Are they just really smart? The truth is that they likely did what everyone else in that situation has to do - get scrappy and just figure it out - and don't give up. \n \"Great CEOs face the pain. They deal with the sleepless nights, the cold sweats, and what my friend the great Alfred Chuang (legendary cofounder and CEO of BEA Systems) calls \"the torture.\" Whenever I meet a successful CEO, I ask them how they did it. Mediocre CEOs point to their brilliant strategic moves or their intuitive business sense or a variety of other self-congratulatory explanations. The great CEOs tend to be remarkably consistent in their answers. They all say, \"I didn't quit.\" \n My second favorite quote from the book speaks to one of the greatest challenges all entrepreneurs face: work/life balance. I like to say \"work hard, play hard\". But sometimes it's easy to forget the play part. Or to buy flowers once in a while. But the cost of those on your health or relationships can cost much more. \n \"As a company grows, communication becomes its biggest challenge. If the employees fundamentally trust the CEO, then communication will be vastly more efficient than if they don't.\" \n Ben had a lot of great advice on how to hire well, especially executives. Looking to avoid reactionary big company execs when you need someone who will come in and get stuff done proactively. Looking for people who can think on their feet and not make everything a nail for the hammer of their prior experience by asking \"How will your new job differ from your current one?\" Looking for people who are mission driven and use the \"team\" prism instead of the \"me\" prism. He also had advice about onboarding, and training. \n Hiring for strength instead of lack of weakness. I've definitely seen instances of this - where a candidate is great in some areas that we really need but isn't great at everything. Knowing what you value most is critical here - and I fully admit - not easy to do. \n \"I'd learned the hard way that when hiring executives, one should follow Colin Powell's instructions and hire for strength rather than lack of weakness.\" \n On hiring internally vs externally. Internal candidates across often do better, which is a great thing to think about when building a team. \n \"when it comes to CEO succession, internal candidates dramatically outperform external candidates . The core reason is knowledge. Knowledge of technology, prior decisions, culture, personnel, and more tends to be far more difficult to acquire than the skills required to manage a larger organization.\" \n One of my favorite sections was \"Managing strictly by numbers is like painting by numbers\". No matter how well you instrument your metrics and goals, you can ever perfectly encapsulate everything you need your company to be doing. Innovation is often like this - with many big innovations the team will often struggle to find how it drives value as it doesn't seem to hit the core metric. But they can all agree it will improve things. I think a big part of the CEO's job is to have a strong product vision, and to not compromise on it. \n \"I often see teams that maniacally focus on their metrics around customer acquisition and retention. This usually works well for customer acquisition, but not so well for retention. Why? For many products, metrics often describe the customer acquisition goal in enough detail to provide sufficient management guidance. In contrast, the metrics for customer retention do not provide enough color to be a complete management tool. As a result, many young companies overemphasize retention metrics and do not spend enough time going deep enough on the actual user experience. This generally results in a frantic numbers chase that does not end in a great product.\" \n Ben talked about the difference between CEO's who can set direction for a company (often founding CEO's) and those can can operationally run it as it grows. How great CEOs need to be good at both, and founding CEOs who don't scale are those who don't learn the operational side. And conversely, operational CEOs who don't get good at making decisions about direction will fail. \n Ben talked about how \"Some employees make products, some make sales; the CEO makes decisions.\" The strength of those decisions is built upon having data. Data about what customers think. Data about what employees think. Data about the metrics. A CEO has to be a constant data accumulating machine. Another nuance was that a CEO can make a decision at any point in time with the data they have now, identify what data would change their mind, and seek it out. \n \"Great CEOs build exceptional strategies for gathering the required information continuously. They embed their quest for intelligence into all of their daily actions from staff meetings to customer meetings to one-on-ones. Winning strategies are built on comprehensive knowledge gathered in every interaction the CEO has with an employee, a customer, a partner, or an investor.\" \n Ben's stories about Loudcloud and Opsware and the Hard Things he dealt with were impressive. I do think they spread too much throughout the book and would have been better concentrated in one part of the book and supplemented by more examples from other companies. But that doesn't detract from one can learn from them. It was strange that he opens each chapter with rap lyrics - that often seem very disconnected to the chapter. I guess he likes rap - but still... \n Pretty cool Ben had Michael Ovitz as an advisor. And that he modeled A16Z after CAA - where instead of independent agents/VCs, have a shared network - and invest in strategic networks that will help the companies. \n Michael Ovitz on dealmaking: \"Gentlemen, I've done many deals in my lifetime and through that process, I've developed a methodology, a way of doing things, a philosophy if you will. Within that philosophy, I have certain beliefs. I believe in artificial deadlines. I believe in playing one against the other. I believe in doing everything and anything short of illegal or immoral to get the damned deal done.\" \n One interesting tendency Ben points out is that \"When a company starts to lose its major battles, the truth often becomes the first casualty.\". You have to be vigilant in looking for the truth, and have backbone spot it. The reason for this, is that \"humans, particularly those who build things, only listen to leading indicators of good news.\" Which is so true! We can always find reasons to excuse away bad news, and reasons to believe good news means more than it should. \n Ben closes with a quote I really believe in - life is about the journey, not the destination. So you have to embrace the journey. Be so mission driven that the struggles you inevitably face are worth it. \"Life is struggle.\" I believe that within that quote lies the most important lesson in entrepreneurship: Embrace the struggle.\"", "date_added": "Tue Oct 07 19:00:16 -0700 2014", "date_updated": "Wed Dec 21 10:43:14 -0800 2016", "read_at": "Mon Mar 02 00:00:00 -0800 2015", "started_at": "Sat Jan 24 00:00:00 -0800 2015", "n_votes": 37, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "5577844", "review_id": "52c8ac49496c153e4a97161e36b2db55", "rating": 5, "review_text": "A beautiful story. Neil Gaiman is truly a unique storyteller. I did a combo of reading and listening to this story, and Neil is great at reading as well. I got interested in this book after seeing the movie, which I really enjoyed. The book is similar - maybe a bit more poetic - but I think the plot in the movie is a bit improved (not much, but a bit). \n I imagine this book came about because Neil read the below poem that he includes in the beginning, and then he invented a plot around it. The result is the book reads like a epic poem - it's creative, magical, and really, just right. \n Go and catch a falling star, \n Get with child a mandrake root, \n Tell me where all past years are, \n Or who cleft the devil's foot, \n Teach me to hear mermaids singing, \n Or to keep off envy's stinging, \n And find \n What wind \n Serves to advance an honest mind. \n If thou be'st born to strange sights, \n Things invisible to see, \n Ride ten thousand days and nights, \n Till age snow white hairs on thee, \n Thou, when thou return'st, wilt tell me, \n All strange wonders that befell thee, \n And swear, \n No where \n Lives a woman true, and fair. \n If thou find'st one, let me know, \n Such a pilgrimage were sweet; \n Yet do not, I would not go, \n Though at next door we might meet; \n Though she were true, when you met her, \n And last, till you write your letter, \n Yet she \n Will be \n False, ere I come, to two, or three. \n And here is my new favorite quote: \"Have been unavoidably detained by the world. Expect us when you see us.\"", "date_added": "Wed Sep 24 09:29:29 -0700 2014", "date_updated": "Wed Oct 01 00:31:56 -0700 2014", "read_at": "Tue Sep 30 00:00:00 -0700 2014", "started_at": "Sun Sep 21 00:00:00 -0700 2014", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "21792828", "review_id": "9bdae13d09e241db98354b9e298dd4a5", "rating": 5, "review_text": "I couldn't put this book down. It was well written - even elegant in a way, as well as though provoking. I love post apocalyptic books as they are great canvas's for humanity, and what matters. In Station Eleven an Ebola-esque virus (the Georgia Flu) knocks out over 99% of the worlds population. This story is told half right before the collapse, and half afterwards, and has several threads that tie together nicely. \n Reading how civilization and infrastructure all die after the collapse is fascinating. One by one, cable tv, the internet, water, and power all eventually stop working. Nobody is alive to maintain them - or who even knows how. Other infrastructure like gasoline to power cars and airplanes, groceries, guns, and even clothing all become rarer and rarer commodities. Really makes you realize how much we are standing on the shoulder of hundreds of years of progress and knowledge, and how far into the middle ages we could easily fall. We really know nothing individually - our civilization is based upon the collective knowledge of billions. \n If there is a motto of the book, it's probably this quote: \"Because survival is insufficient\". Humanity craves for more than survival - we crave for something more out of life. The story follows a caravan of actors and musicians who travel from town to town to play Shakespeare, and bring some art and a shared experience. Interesting that of all the artists from the past 400 years, Shakespeare is the one that survives and still resonates. \n \"All three caravans of the Traveling Symphony are labeled as such, THE TRAVELING SYMPHONY lettered in white on both sides, but the lead caravan carries an additional line of text: Because survival is insufficient.\" \n \"Survival might be insufficient, she'd told Dieter in late-night arguments, but on the other hand, so was Shakespeare.\" \n The storyline pre-collapse that follows Arthur and his three wives is interesting. I won't say much about it, other than Arthur, his wives, and the paparazzi-turned-jounalist-turned-paramedic-turned-doctor Jeevan, seem to all be searching for meaning in their lives. And ironically Jeevan seems to find the most, becoming a doctor after the collapse. Also, I'm glad I'm not a Hollywood celebrity. The conversation between Arthur and Jeevan where Arthur just wants to talk about anything but himself stuck with me - sometimes we are all sick of talking about ourselves. \n Regardless of what you think about this book, one thing is for sure - after you put it down and walk around the world, you are full of a newfound appreciation and gratitude for everything. Hopefully that appreciation and gratitude will stick around a little - though I know it will fade as months and years go by. \n ps. This is cool:", "date_added": "Mon Sep 22 13:37:09 -0700 2014", "date_updated": "Wed Mar 22 11:47:36 -0700 2017", "read_at": "Thu Nov 20 00:00:00 -0800 2014", "started_at": "Mon Nov 17 00:00:00 -0800 2014", "n_votes": 45, "n_comments": 4}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "19816540", "review_id": "c4b189ec81de0820373c7d729e687f81", "rating": 5, "review_text": "Recommend this highly for anyone who works in a technology or creative field. Pixars track records is unparalleled - 14 movies and all of them have been massive hits. I had two important takeaways from this book: how to build a great, lasting culture, and how to build a creative company. \n Catmull's philosophy both around creating movies and managing his company, is to be relentless about remembering that he doesn't know what he doesn't know. In creating a movie, you don't know what it will be when you start. In creating a company, you similarly don't know what it will be, especially at first. But equally importantly when you are scaling it, you don't know the dynamics of what is happening throughout the company - you will have a filtered view based on the (always) incomplete picture you can see. So you have to relentlessly have the mindset to remember that there are dynamics at play that you don't know, and look for them. \n \"From that day on, I resolved to bring as many hidden problems as possible to light, a process that would require what might seem like an uncommon commitment to self-assessment.\" \n \"I believe the best managers acknowledge and make room for what they do not know--not just because humility is a virtue but because until one adopts that mindset, the most striking breakthroughs cannot occur.\" \n So how did Pixar build 14 hits in a row? They created a highly leveraged feedback loop. They created a culture of open feedback, and encourage anyone in the room - regardless of rank - to have an equal voice. They have lots of ways to get feedback on the film and iterate on it: from daily standup every morning to review scenes, up to braintrust meetings with all the best directors and creative minds to review the story. They spend a lot of time - years - iterating on and nailing the story before putting it into production - and even then they keep iterating. Nothing trumps good story. \n \"Braintrust meetings require giving candid notes, but they do a great deal more than that. The most productive creative sessions allow for the exploration of myriad trains of thought.\" \n \"The first step is to teach them that everyone at Pixar shows incomplete work, and everyone is free to make suggestions. When they realize this, the embarrassment goes away--and when the embarrassment goes away, people become more creative.\" \n \"in Japanese Zen, that idea of not being constrained by what we already know is called \"beginner's mind.\" And people practice for years to recapture and keep ahold of it.\" \n I loved the concept of \"the beast\" - which is the trap of needing to continue to succeed a higher and higher levels. \"It is one of life's cruel ironies that when it comes to feeding the Beast, success only creates more pressure to hurry up and succeed again.\" An important point to this was that feeding the beast means bigger and better, and taking less risks. To create something new, you have to have the right leadership to shelter the seed and let it grow. \n The stories about Steve Jobs were great. Made you respect him even more. For taking a huge financial risk to spin Pixar out of Lucasfilms and then personally float it for a long time, taking even more risk. I loved hearing about how much foresight he had with regards to Disney and negotiating that deal. I also loved the story about the wide screen - basically how Steve responds to passion, and pushes people until he finds where it is. This quote explains it well: \n His method for taking the measure of a room was saying something definitive and outrageous--\"These charts are bullshit!\" or \"This deal is crap!\"--and watching people react. If you were brave enough to come back at him, he often respected it--poking at you, then registering your response, was his way of deducing what you thought and whether you had the guts to champion it.\"", "date_added": "Fri Aug 29 14:21:57 -0700 2014", "date_updated": "Tue Nov 18 01:38:37 -0800 2014", "read_at": "Fri Nov 07 00:00:00 -0800 2014", "started_at": "Thu Sep 18 00:00:00 -0700 2014", "n_votes": 26, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "17855756", "review_id": "9db60af739f79f40c0016b924a5326b4", "rating": 4, "review_text": "What a fun series. I loved Wool, and Dust and Shift both gave us the backstory to explain the world and how it ended up. I think the first book was by far the best, but this gave us a nice conclusion. \n It was the conclusion we wanted to see - the people finally get outside! My problem with this book is there were lots of holes. A lot of the other reviews have pointed this out too, and I'm not sure if the fact I know it was self-published is biasing me to say it could have used more editing, but feels that way a little. But the writing was great. \n There were lots of things that weren't cleared up or never really fully made sense. The major one is why Thurman really felt the need to destroy the whole world - feels like there could have been a lot more to that. It also wasn't clear how he really accomplished that - was it all nuclear or was it nano? If nuclear, wouldn't the world really be a wasteland? \n Whatever happened to silo 40 and other silo's that went dark? I was kind of expecting that they had already broken outside and would have been waiting there. Or perhaps they already went to the sea and Hugh will tell us their story later. \n What happens to the other silos after silo one is destroyed? Didn't it power their server rooms and probably provide other stuff including guidance to the silo heads? Will they make the 200 years on their own? \n The mystery of silo 17 and why the dead bodies at the top didn't rot was never really explained. I'm guessing they were kept whole by healing nano's, but it felt like there was more to that story. \n I didn't understand why Anna didn't come back to life. If Thurman could do so after being killed by Donald, why not her? All the love stories (Juliet and Kyle, Donald and Anna, etc ended up sadly - I wanted one happy one. \n If anything, I think this book is about hope and resiliency. Jules and Donald and even Solo weren't perfect, and suffered through a lot, but the only thing that kept them going was hope of a better life, and determination to keep themselves alive. That determination defined them and was what we admired about them. The hope was what gave them their drive. Hope is a powerful and necessary part of human psychology.", "date_added": "Sat Jul 26 10:54:20 -0700 2014", "date_updated": "Sat Jul 26 13:10:06 -0700 2014", "read_at": "Sat Jul 26 13:10:06 -0700 2014", "started_at": "", "n_votes": 3, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "16158596", "review_id": "6ff8bbc4856aa403bbd8990407c9c77a", "rating": 0, "review_text": "Recommended by David Risher", "date_added": "Mon Jul 07 10:56:15 -0700 2014", "date_updated": "Mon Jul 07 10:56:39 -0700 2014", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "12961964", "review_id": "04659501bdec2cf924d5cb0348ca1d8f", "rating": 4, "review_text": "A classic dystopian novel published in 1985, but still very relevant - and even trending in 2017 due to the political climate. I liked how it unfolded - we learn about the state of the world and what has happened to it very piecemeal throughout the book, and I think if Atwood had just described it all up front it wouldn't have been nearly as compelling. \n This book seems to be a kind of warning. It describes a future state that is chilling and depressing, and yet (to the point) chillingly possible. It describes a society that has - for reasons we never quite learn (but might have to do with radiation or sterilization?) remade itself from one where everyone has basic freedom and choice, to one that is the opposite of that. Pleasure, poverty, and other evils are eliminated in this system. And most chillingly, women have almost no rights. The books main character is a \"hand maiden\" who's only role is to bear children from the person who seems to have purchased/acquired her for that purpose. She doesn't even have a proper name anymore - she is called \"Offred\" because she is the property \"of Fred\". \n \"We were a society dying, said Aunt Lydia, of too much choice.\" \n A lot of the book explores themes like the above - what it would be like to take away basic freedoms, choices, and also ability to have relationships with others. Chilling and depressing, because so much of what we value in modern society is our freedom. And yet, we do know that too much choice does paralyze, and many people want leaders and situations that simplify the decisions they have to make. This might sound like a balance, but its not, because our ability to make choice, especially bad choices, is actually crucial to our development. \n \"Better never means better for everyone, he says. It always means worse, for some.\" \n This was an insightful sentence, because it implied the commander thought they were making society better, not worse, overall. And yet clearly for everyone in the book - including the commander - it doesn't sound better. Did they just miss the mark? Was it a big experiment gone wrong? Regardless, in todays world this sentence is perhaps most applicable: \n \"We lived, as usual, by ignoring. Ignoring isn't the same as ignorance, you have to work at it. Nothing changes instantaneously: in a gradually heating bathtub you'd be boiled to death before you knew it.\"", "date_added": "Thu May 22 10:25:45 -0700 2014", "date_updated": "Sun Apr 23 13:55:20 -0700 2017", "read_at": "Sat Apr 15 17:11:13 -0700 2017", "started_at": "Tue Mar 21 01:42:39 -0700 2017", "n_votes": 60, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8125726", "review_id": "39bdabfebf42c6dce73d0299a23b3964", "rating": 5, "review_text": "Great explanation of the theory of constraints and operations management. It's a business classic- first published in 1984 - but still relevant as it gets at the fundamentals. I almost removed a star for trying to create a fictional story to tell the book in that was badly told/edited. Did we really need the side story about the protagonists marital issues? \n One of the biggest takeaways from this book is that it's incredibly important to set the right goals to manage a complex operation. This sounds obvious and intuitive, however it's actually much harder than most people think, and easy to get wrong. It gets down to the question of: is everyone working on the \"right things\". The things that will lead to the business making the most money. It's too easy to find a things that are easily measurable and saying \"this thing is correlated with our success, so let's focus on it\". It sounds like \"cost accounting\" fit into that bucket. \n \"What you're saying is that making an employee work and profiting from that work are two different things.\" \n So how do you set the right goals? Focus on making money! \n \"So this is the goal: To make money by increasing net profit, while simultaneously increasing return on investment, and simultaneously increasing cash flow.\" \n One of the drivers of making money in any business that creates a product is throughput, or how fast a product can be made. The others are costs/operating expenses, and inventory. One of the key concepts of the book is that focusing on throughput rather than costs will yield much better results. \n \"The entire bottleneck concept is not geared to decrease operating expense, it's focused on increasing throughput.\" \n The bottleneck theory, or the theory of constraints, was very useful to think about. My company produces software and not physical products, but each feature we develop definitely has steps it has to go through: creating the concept, research, spec, design, implementation (backend and client), testing, QA, measure results, analyze them, iterate, etc. Focusing on where the bottlenecks are with that process can help us move faster. And every startup needs to be moving fast - and not just at building - we need to be doing build, measure, learn as fast as we can. \n A consequence of the bottleneck theory that is useful to keep in mind is that in any system only the bottlenecks should be 100% utilized. Every manager will have a natural tendency to want to utilize all their resources to 100% because that just seems... wasteful if you don't. People should be working full time right? But a system can only run at the speed of the slowest bottleneck, so non-bottlenecks will by definition have spare cycles, and it's important to keep them open for the important work and not fill it up with unimportant stuff that will bog them down when you actually need them on the important stuff. \n I've seen this happen many times in software. An engineer finishes a project, and the big important project coming from the design team isn't done yet, so he picks up something small in the meantime. The next day that big important project is ready to go, but the engineer only needs \"one more day\" to finish this thing he started. And then that day becomes two and then three (because we didn't count QA). And then we've lost 3 days on our most important project for another project that doesn't matter at all. Add that up across a large number of developers, and you've lost a lot of time. \n The theory of constraints is not limited to manufacturing, as the author shows. In the end, he is advocating it as a method or process of learning. \n STEP 1. Identify the system's bottlenecks. \n STEP 2. Decide how to exploit the bottlenecks. \n STEP 3. Subordinate everything else to the above decision. \n STEP 4. Elevate the system's bottlenecks. \n STEP 5. If, in a previous step, a bottleneck has been broken go back to step 1.", "date_added": "Mon May 05 11:27:56 -0700 2014", "date_updated": "Fri May 23 01:42:12 -0700 2014", "read_at": "Sun May 18 00:00:00 -0700 2014", "started_at": "Mon May 05 00:00:00 -0700 2014", "n_votes": 23, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "17315048", "review_id": "885c772fb033b041f42d57cef5be0a43", "rating": 5, "review_text": "Mark Watney is a steely-eyed missile man. A man's man. A badass mechanical engineer botanist astronaut who is stranded on Mars during a Nasa mission gone wrong, and left to fend for himself. I listened to this on audio on a roadtrip, and it flew by - what a fun story. Not surprised at all it's being made into a movie directed by Ridley Scott starring Matt Damon. Also pretty amazing is that it was self-published. \n There were two great things about this book: the humor and the science. The science appealed to the mechanical engineer in me - Watney is a bit like McGyver except he knows a lot more about chemistry and botany. I didn't double-check all the science, but loved the descriptions of all the math: calorie calculations, creating water, etc. Just fun stuff. \n But the humor was top notch. Weir does a great job portraying a stranded man trying to remain upbeat by talking to himself in log entries. And the excellent audio narrator only made it better. \n \"I started the day with some nothin' tea. Nothin' tea is easy to make. First, get some hot water, then add nothin'.\" \n \"Yes, of course duct tape works in a near-vacuum. Duct tape works anywhere. Duct tape is magic and should be worshiped.\" \n \"Live Another Sol would be an awesome name for a James Bond movie.\" \n In the end, a well told story of survival against the odds. And one of belief - I liked the CNN Mark Watney watch - you could totally imagine how into this story the media would get. We humans love a good surviving against the odds story.", "date_added": "Sat Apr 05 09:30:53 -0700 2014", "date_updated": "Wed Mar 22 11:33:10 -0700 2017", "read_at": "Mon Aug 25 00:00:00 -0700 2014", "started_at": "Sat Aug 16 00:00:00 -0700 2014", "n_votes": 25, "n_comments": 5}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "17860739", "review_id": "022bb6daffa49adc27f6b20b6ebeb37d", "rating": 4, "review_text": "An amazing and unique creation: JJ Abrams and Doug Dorst created what reads like a classic work of fiction - something you can easily imagine having read in English class - and then wrote a intriguing side story in the margins. A grad student (Eric) has left his annotated copy of SOT (Ship of Theseus) in the library, and an undergrad (Jen) finds it and replies to his annotations. This leads to them making exciting discoveries about the book, and also falling in love. \n The first thing is this book is just beautifully printed. It looks and feels like a classic book, to the point where people would ask me why I'm reading such an old book. The marginalia feels real, and I can only imagine how hard that was to print. This is one that will be cool to keep on the shelves. Only complaint is the inserts are a cool idea, but they fall out all the time, and at this point I have no idea which pages they were supposed to be on. \n The most interesting thing about this book to me is that it's a blueprint for how people discuss books. Sometimes they discuss the content of the book. Other times they use the content as a jumping off point to have a personal discussion. The nature of this book shows both, almost split 50/50. A key difference with this book - and the genius of it - is that most of us have to rely on memory to start a conversation with someone about a particular event or passage in the book. Here, our characters can literally underline a phrase like \"relationships\" and then talk about what is happening in their relationship at the moment. \n One thing I didn't realize until later in the book is that the ship of Theseus is a real thing - it's an ancient Greek philosophical question - if you replace all the parts of something, is it still the same object? This inspires the ship that S is captured on, which sails through the mists of time, always getting fixed when needed. It's a ship that can't die. Or a series of ships :) \n I found the story of Jen & Eric a lot more compelling than the SOT story. They were real characters that you could relate to. SOT felt like books you read in english class - a bit obtuse - and I still don't understand it all. But don't get me wrong - it's a pretty cool story. I particularly enjoyed the themes - like how it all begins and ends with water, and also how it was a lot about Straka's regret to fulfill his mission instead of living his life with his true love. Kind of like how S was on a mission, but didn't really know why - he just found himself caught up in it.", "date_added": "Wed Mar 26 13:51:30 -0700 2014", "date_updated": "Tue Sep 23 01:44:36 -0700 2014", "read_at": "Sun Sep 21 00:00:00 -0700 2014", "started_at": "Sat Jul 26 00:00:00 -0700 2014", "n_votes": 7, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "137554", "review_id": "6f74c6ca4ac2be7c71237d4d0fd4623d", "rating": 0, "review_text": "Sacca and Nate recommend", "date_added": "Thu Mar 20 10:12:34 -0700 2014", "date_updated": "Thu Mar 20 10:13:07 -0700 2014", "read_at": "", "started_at": "", "n_votes": 4, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "210009", "review_id": "ff905f86a19cd9c26667fa0245bc1ea7", "rating": 5, "review_text": "One of the best books on leadership I've read. Many people struggle to articulate what leadership really is. This book put a more fine point on it, suggesting that leadership is creating change. The author likes the word \"adaptive change\". Once a solution to an issue has been accepted and is in motion, it becomes a management issue - a matter of execution - not a leadership issue. Creating change is not easy: \n An adaptive change that is beneficial to the organization as a whole may clearly and tangibly hurt some of those who had benefited from the world being left behind. \n An important point the book made was people can generally only stand so much change at a time. So you have to limit the amount of change you are creating at any given point. A leader also helps people get through the change. They have to acknowledge the change and that it will be difficult, and convincingly paint the picture of why it's worth going through. \n When you lead people through difficult change, you take them on an emotional roller coaster because you are asking them to relinquish something--a belief, a value, a behavior--that they hold dear. People can stand only so much change at any one time. \n Another good concept was that of finding the \"orienting value\", and finding ways to drive it home and constantly remind people of it. For instance, Roosevelts New Deal or MLK's I Have A Dream speech. Create an image that people can latch onto and keep repeating that everywhere. \n To sustain momentum through a period of difficult change, you have to find ways to remind people of the orienting value--the positive vision--that makes the current angst worthwhile. \n Sometimes, conflict has to be worked out among constituents instead of having a solution dictated. I loved the story about Scottie Pippen disobeying Phil Jackson, and then Jackson saying to the team What happened has hurt us. Now you have to work this out. and then leaving the room. Solutions are often achieved when the people with the problem go through the process of creating the solution together. \n I liked how the book got into the deeper meaning of life in the end. I've always believed that people need purpose in life, and the authors confirmed that, but warned against getting too wedded to one particular purpose. A useful reminder that the person makes the purpose, not the other way around. We can love our jobs, but it's dangerous to let them define us.", "date_added": "Mon Mar 10 00:06:50 -0700 2014", "date_updated": "Mon Jul 07 00:49:16 -0700 2014", "read_at": "Mon Jun 30 00:00:00 -0700 2014", "started_at": "Mon Mar 10 00:00:00 -0700 2014", "n_votes": 7, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "5064", "review_id": "da4757c50c0edb081ca124d33db8186b", "rating": 5, "review_text": "I tore through The Pillars of the Earth, and couldn't wait to pick this up. Set in Kingsbridge but a few centuries later, the story has a lot of similar elements: a cathedral that needs repair, a brilliant young builder (Merthin), a love story, a priorship up for grabs, and of course political manuevering, backstabbing and evil church officials. Also like the first one, the characters were developed well, the book was hard to put down, and yet it wasn't a deep book, just a fun one. Thank goodness I finished - it was causing me to lose sleep. \n I did enjoy learning about the plague, and medieval ideas on health and medicine. Amazing that the plague wiped about a third of the human population, and how little they knew about it. Was frustrated by the lack of the Monks openness to learn new things, and how little they trusted women. For instance they believed in bleeding as a solution to everything when it actually is harmful in most cases. Also was interesting that there was no such thing as a doctor - instead nuns/monks/etc served that role.", "date_added": "Sun Mar 02 12:34:19 -0800 2014", "date_updated": "Tue May 06 10:47:06 -0700 2014", "read_at": "Sun Apr 27 00:00:00 -0700 2014", "started_at": "Thu Apr 17 00:00:00 -0700 2014", "n_votes": 2, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "19404862", "review_id": "cb51bb39b5375d8cb34805f8ac8b6cea", "rating": 4, "review_text": "Extremely valuable book for anyone building products designed to engage people frequently. Given that I think daily about how to make Goodreads better and more engaging for people, this was a useful book. I think I knew a lot of it already, but often being forced to think about things again can be useful - and there are a few useful new ways of thinking about things that I learned. \n One of the main useful ideas the book talks about in engaging users is having triggers to bring the user back to the product. This can be an external trigger - like an email or notification or ad that brings the user back - but the best products also form internal triggers. Ever get bored or lonely and find yourself on Facebook? Or wondering what is happening in the world and end up on Twitter? Or see something beautiful or inspiring and then pull out Instagram? Or feel the need to escape and relax and open a book or turn on a movie or a sports game? Our emotions often drive our behavior, and each emotion is mapped to a set of products we could use to \"scratch the itch\" of whatever we are feeling. These mappings become habits. \n \"Once a technology has created an association in users' minds that the product is the solution of choice, they return on their own, no longer needing prompts from external triggers.\" \n I think my favorite external triggers mentioned in the book were from the bible app example, where it sent a push notification to people if they walked into a strip club! And it sent another one on xmas day that did well. Timely matters! \n Nir then talks about how to get users to take actions. The framework is obvious, but very true, and useful to remember when evaluating products. It's fairly well summed up in the below quote. There was a lot of good discussion about point #2 in terms of having simple design, being mobile, etc. \n there are three ingredients required to initiate any and all behaviors: (1) the user must have sufficient motivation; (2) the user must have the ability to complete the desired action; and (3) a trigger must be present to activate the behavior.\" \n Another point Nir makes around actions - which is also an obvious one but worth really paying attention to when designing a product - is around getting frequent engagement with a product when a user is new to it. \n \"For new behaviors to really take hold, they must occur often.\" \n \"frequent engagement with a product--especially over a short period of time--increases the likelihood of forming new routines.\" \n The author then talks about variable rewards. I've known that variability - or serendipitousness as I like to think of it - is a very important driver of any engaging product. It's why we love sports, gambling, games, Facebook newsfeed, and good stories - not knowing what we'll find is exciting. Nir breaks down variable rewards into three types - the tribe, the hunt, and the self. The tribe is social validation - think of Facebook likes on content you posted. The hunt is something intrinsic in our brains that dates back to prehistoric times when we literally lived for the hunt - think of hunting for interesting content on your Twitter feed, or gambling looking for payoffs. The self is more for personal gratification - wanting to complete a puzzle you started or beat a video game you started.", "date_added": "Tue Jan 07 00:58:43 -0800 2014", "date_updated": "Wed Mar 22 11:47:28 -0700 2017", "read_at": "Thu Dec 18 00:00:00 -0800 2014", "started_at": "Tue Nov 25 00:00:00 -0800 2014", "n_votes": 48, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8545079", "review_id": "c439d156b3902465ff5f42de46aa074f", "rating": 5, "review_text": "5 stars for being a un-put-downable page-turner, full of interesting and engaging characters I empathized with, and for teaching me about the politics and religion of the middle ages. Follet is a thriller writer, and it shows. \n Fascinating that in medieval times, most villages were surrounded by walls (or were inside a castle) - because you couldn't count on the law to marauding rival lords from raping and pillaging your village. And the largest buildings other than the local lords castle, were cathedrals. Why did people spend so much time an energy building these huge monuments to God that took 10-20 years to build? The book explains that bit, with the importance of the Church in society and it's relation to the crown. \n I am having trouble putting my finger on what I liked about the book. To friends who asked, I can't sell it every well. But it was a epic saga of love and power, and I loved every second. I think in the end, the lesson was that creating enemies leads you to get what you deserve. This might be a good summary of the book: \n \"The duck swallows the worm, the fox kills the duck, the men shoot the fox, and the devil hunts the men.\" \n For the record, I hate William Hamleigh. I love Jack - he reminds me a bit of Howard Roark. And Aliena was inspirational. Philip was a prude but a good dude - I still can't believe he forgave Remigius. Interestingly, Waleran is once described as good person who just misunderstood his priorities - but I don't buy that.", "date_added": "Sat Dec 28 21:53:51 -0800 2013", "date_updated": "Mon Apr 11 02:39:22 -0700 2016", "read_at": "Mon Mar 10 00:00:00 -0700 2014", "started_at": "Mon Feb 10 00:00:00 -0800 2014", "n_votes": 13, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "460548", "review_id": "1e4de11dd4fa4b7ffa59b6c69a6b28e9", "rating": 5, "review_text": "My daughter is loving this. Published in the 60's and one of the best I've found!", "date_added": "Mon Dec 02 10:43:59 -0800 2013", "date_updated": "Wed Mar 22 11:47:25 -0700 2017", "read_at": "", "started_at": "", "n_votes": 5, "n_comments": 4}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "18659415", "review_id": "4e652faa682edfcb0c0e1effdd1f8e58", "rating": 4, "review_text": "The Circle is a new bay area company, but is really Google+Facebook. It dominates search and social media, has a huge sprawling campus in the south bay, and is full of intelligent, ambitious young employees. This story is I think a take on where the connected nature of the internet might be taking us. It's essentially a discussion about privacy vs openness, and I think a serious 1984-esque warning about being too open. \n I thought a lot of the book was kind of shallow and unrealistic. The characters weren't very well developed. And I can't imagine an HR department that would get on your case for not using social media or attending a brunch you were invited too - it was just too extreme to believe. But I suppose that was on purpose, as the author was just making a point. I appreciated the point (see below), but didn't love the story. \n Mark Zuckerberg has been fairly public on saying that he believes a more open society is a better one. The notion is exactly the one Mae learns with the kayak incident - if your whole life is open to your friends and family, it's very hard to do anything dishonest or that you might regret. The premise of the Circle - that privacy and secrecy are bad - is taking this idea to an extreme that I doubt Zuckerberg or anyone else who runs a social network has ever contemplated: complete openness. Or as its motto says: \n All That Happens Must Be Known. \n It is easy to imagine us eventually living in a world like the Circle contemplates. With public video cameras everywhere that document everything we do, and tons more data (photos, videos, texts) available to search engines to scan through. Already there are startups like Dropcam that enable public video feeds that are archived. There are atm and building and traffic cameras everywhere that the police already use. I heard of another startup that puts a video camera on you and it takes photos of everything all day and creates a montage of your day that is searchable/sortable for you. In many ways, we should already start acting like everything we do at least outside of our homes is being recorded on camera. \n I think the central question the book poses is the one Bailey contemplates with Mae: is there such a thing as a good secret? Should we have privacy at all? Or would the world at large be better off if all secrets are known? I think we know where Mr Eggers stands on the subject, as the book seemed to be written in a dystopian, mocking kind of way. But it is in an interesting thought experiment, as many secrets would ultimately be better overall (not necessarily for the disclosing party, but for the overall situation), if they were known. For example you don't want to tell your friend that you know their significant other is cheating on them b/c you aren't supposed to know, but ultimately it would be better for them to know. Can you think of a secret you know that should be a secret? \n But of course, there are lots of secrets that should stay secrets. Ignorance often truly is bliss, and people often just need to be weird and express themselves in ways that not everyone would appreciate if it were open. We are private beings, and yet our dignity and sense of self-worth largely stems from how others perceive us. I think this book is a thought-provoking story that shows us how our society is changing.", "date_added": "Wed Nov 20 17:02:03 -0800 2013", "date_updated": "Fri Jan 10 21:19:05 -0800 2014", "read_at": "Sun Dec 22 00:00:00 -0800 2013", "started_at": "Wed Dec 18 00:00:00 -0800 2013", "n_votes": 30, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "123715", "review_id": "3fab162bbd3f1c9b358a8c06a4da135b", "rating": 4, "review_text": "I think there is one big idea to Slack that makes it worth reading for anyone dealing with leadership or leading at scale. A lot of the rest of the book is fairly obvious or not practical, so not giving it five stars. \n The big idea of this book is that creativity can't be rushed, and if you don't build the slack into your schedule to spend some time creatively thinking about your business, you won't be able to innovate. You will only be able to be reactive, not proactive. The \"Hurry Up\" mindset is so easy to slip into - because there is always more to do than there is time. Providing a theory and data around the fact that having slack in your schedule is not only ok, but it's a good thing, is almost counter-intuitive, and thus really valuable to think about. \n The book talks about how some companies slip into a \"hurry up\" mindset where everyone wants to look busy all the time. The danger of being busy is that you can too easily - especially if you are only being reactive - be busy on working on the wrong stuff. \n \"Very successful companies have never struck me as particularly busy; in fact, they are, as a group, rather laid-back. Energy is evident in the workplace, but it's not the energy tinged with fear that comes from being slightly behind on everything.\" \n When managing people there is another kind of slack that the book points out: the slack to give up control to someone. Highly functioning people like to own their goals and process and have leeway to accomplish them on their own. As a manager, one of the hardest tasks is to balance giving them that autonomy with occasionally checking in or diving in to make sure things are on track. If you do it too much, you will annoy people or cause them to leave - if you do it too little your team could be wasting time heading in the wrong direction. \n Other interesting points: \n * In a hurry up organization, there is a natural tendency to try to get people to work harder/more to meet deadlines. While this can work over short stints, it's generally not sustainable. In fact, the book had a bunch of data to show that on average overtime hours aren't more productive. \n * They analyzed the \"star performers\" in a number of companies, and the only thing they had in common they could point to was the strength of their networks. Establishing good connections and doing favors for others let's you get stuff done faster when you need to. \n * The book makes a point that setting Quality goals for companies can be dangerous b/c you can so easily focus on the wrong metrics. For instance, reducing the number of bugs is correlated with quality, but it isn't the same thing as making a great product. This seems pretty obvious, so I'm not sure why it needed to be included in the book. \n * It's important to set a vision for the organizations culture. The culture are those things that are so important to the organization that they should never change. If a organization lacks those, it will define itself as status quo and resist all change. \n * Effective leaders build up trust, often before they've even earned it. The most effective way to do this is to acquire trust by giving trust. The act of giving trust is an enormously powerful gesture. The author told a story about a woman giving him her 2 year old daughter to carry off the plane. The trust she showed impressed him. \n A great summary of the book: \n \"Reinvention takes place in the middle of the organization, so the first requisite is that there has to be a middle. I'll assume your organization still has one. Now pour in some slack, increase safety, and take steps to break down managerial isolation. Viola, the formula for middle-of-the-hierarchy reinvention.\"", "date_added": "Fri Nov 08 15:25:13 -0800 2013", "date_updated": "Wed Apr 16 22:14:58 -0700 2014", "read_at": "Sat Apr 12 00:00:00 -0700 2014", "started_at": "Fri Dec 27 00:00:00 -0800 2013", "n_votes": 13, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "17451257", "review_id": "f43ec67af36581ae493216dba81af2b4", "rating": 5, "review_text": "A fascinating in-depth and well researched look at the processed food industry. I recommend this for anyone who buys food at a grocery or convenience store (aka everyone). I read this book hoping to learn more about processed foods and how to avoid them, and I definitely got what I was looking for. Before reading this I was trying to avoid processed foods, and this book has helped increase that resolve, as well as educated me more on how to do it. It is absolutely amazing and frightening how many processed foods - some of which I remember fondly like Capri Sun - have enough salt/sugar/fat to easily account for a quarter or half of your daily recommended limit. This makes it super easy to go way over, and the result is unhealthy, fat Americans. \n One of the more powerful things of this book was that Moss went deep into the food industry to really understand the dynamics at play. He didn't just demonize them for making the US one of the fattest countries in the world. He interviewed dozens of insiders - current and retired, to get their perspectives. \n And the bottom line is scary. The food industry has zero incentive to produce healthier food. Because the high calorie food that they make that is stuffed with salt, sugar, and fat sells really well. It's tasty and convenient and cheap, and people buy whats tasty, and have no time or money to make or buy healthier options. And when the industry has tried to reduce the salt, sugar or fat, every time they find that it doesn't sell as well. Sure they have made some incremental improvements here and there, but by and large, the grocery store is a scary place if you don't want to vastly exceed your daily caloric intake. \n It seems clear to me that things will never get better without government intervention - something that Moss also concludes in the book. Trying to understand a food label is impossible for most people, as (1) you have to know by heart the daily recommended values for calories, salt, sugar, and fat, and (2) you have to do math to figure out how many servings you are eating. Doing both of these just won't happen for 99% of the population, and thus we are where we are. We cannot rely on the food industry to make healthier products - we have make them do so by choosing with our wallets. \n In my opinion, the FDA or someone in the government needs to get a good designer to fix food labels and get them to a state where any American can easily look at them and go \"oh my gosh this [can of pasta sauce] will account for [a quarter] of my daily recommended [caloric/protein/fat/sugar] intake if I eat it\". Maybe some startup can combine a phone camera and some image recognition to do this. The right organization to drive this is the FDA, but they are not acting. \n So why doesn't the government act to prevent the obesity epidemic (and yes, that word is appropriate)? Moss spends a bit of time in the book examining this question, interviewing people at the FDA and the Dept of Agriculture. His conclusion is that they aren't incentivized or enabled to act. The food industry is well capitalized and has - for some inescapable reason to me - been able to fight every report of how bad their products are. Regulation is a tricky subject in America, but it seems that even the role of getting information to Americans about how to protect their health is completely broken. \n One of the more interesting things I learned from the book is how sophisticated the food industry is in marketing their products. Their segmentation is impressive, and they find the right products, messages and mediums for each segment. They have learned to be on top of trends and perform slight of hand tricks with ease. For instance Americans initially loved their breakfasted cereals when marketed using the word \"sugar\". When people finally caught on that many of these were 50-70% sugar (!!!) the industry changed their marketing to promote other aspects, and removed the word sugar. Sugar Frosted Flakes became Frosted Flakes. Same thing for \"low salt\" or \"low fat\" or \"includes some vitamin or nutrient\" trends. \n This is good to know if you are in the grocery store, as they still use these tricks. If a product is \"low sugar\", it's probably high in fat and/or salt, and same for \"low fat\" or \"low salt\". Or they will pick a nutrient or vitamin and promote that to hide the high amounts of salt, sugar & fat - for instance Tang was marketed as having lots of Vitamin-C (but was and is really bad for you). \n One of the biggest trends that led to processed food in the past 40 years is summed up by the word \"convenience\". That's been a big part of the food industries marketing tactics, and it's worked. Life has become increasingly busy and complex, and we don't have time to go to work *and* shop for and cook a healthy meal. An aspect of this that I hadn't thought about is the rise of dual-working families - we have gone from 50% of women in the workforce in 1970 to 80% today. Families simply don't have time when both parents work to spend hours cooking when they get home. Thus, \"convenience\", or foods that are easy to buy and make, have risen drastically in that timeframe. \n Emotionally, I could see how this marketing worked on me as a kid. Hearing about products that I used to eat and remembered fondly was kind of sad. Capri Sun, lunchables, hot pockets are just a few such examples mentioned in the book, none of which is particularly good for you. \n The most damning evidence Moss finds is that none of the executives or insiders he talked to eat their own dogfood. In fact, they all have diets that explicitly prohibit it. I think that's very telling. \n Overall, I think book will open your eyes to the \"battlefield\" for space and attention that goes on in the grocery store, and to pay more attention to the labels. That's a big educational process, but one which everyone needs to learn how to do. We need to force the food industry to stop producing foods that are unhealthy by stopping buying them.", "date_added": "Sun Jul 07 08:00:29 -0700 2013", "date_updated": "Sun Jul 07 08:00:29 -0700 2013", "read_at": "Sun Jan 31 00:00:00 -0800 2016", "started_at": "Tue Jan 12 00:00:00 -0800 2016", "n_votes": 28, "n_comments": 4}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "13526165", "review_id": "51fe3e46c7f8eb39f5623d1bd8bbbbfc", "rating": 5, "review_text": "My wife suggested I read this book, and I resisted for a while as my impression of it somehow was \"not for me\" - but I was wrong! I'm glad she finally convinced me, because it was fun and I couldn't put it down after I got ~20% in. \n Bernadette moved to Seattle from LA, abandons her career as an architect to have kids, hates Seattle, and basically loses it over the course of the book. The book was fun and written a light, humorous tone - from making fun of Seattle and Microsoft, the obsession of parents and how serious they take themselves (I loved how she called the other parents \"gnats\"), to how she hires a virtual assistant in India. \n But the most fun part of the book is just how wacky Bernadette is. You really do have to make life fun - it won't do it for you. \n \"That's right,' she told the girls. 'You are bored. And I'm going to let you in on a little secret about life. You think it's boring now? Well, it only gets more boring. The sooner you learn it's on you to make life interesting, the better off you'll be.\"", "date_added": "Thu May 30 20:25:19 -0700 2013", "date_updated": "Wed Mar 22 11:47:21 -0700 2017", "read_at": "Wed Mar 18 00:00:00 -0700 2015", "started_at": "Tue Mar 10 00:00:00 -0700 2015", "n_votes": 23, "n_comments": 5}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8622058", "review_id": "43557cf2ffe572c2a7d814f2b48fffbc", "rating": 5, "review_text": "A wonderful, beautifully written, poignant, subtle, and brilliant novel. \n This is the story of an English butler of one the great houses, whose self value comes from his duty and his dignity, and who questions his values and his life in the end. It is ultimately a story of regret. It is a story that makes you want to live your life and dedicate yourself to things that you won't regret when you look back. One of the best ways of thinking about regret I've ever come across is from Jeff Bezos in his nerdily titled Regret Minimization Framework. \n But what I really loved about the novel is how slow and forcefully it builds. I don't think I've read a book that does that so well since Pride and Prejudice. In the beginning you think it's just a butler going on a motoring trip. And at the end, your heart is breaking. \n Dignity is a big theme in the novel. Stevens attempts to define dignity several times throughout the novel - his definition generally has to do with self-respect and keeping ones emotions in check. But you have to wonder - his is suppression of emotions what leads him to where he ends up? His pushing himself to \"banter\" is a an interesting indication of him trying to break that pattern. \n \"We may now understand better, too, why my father was so fond of the story of the butler who failed to panic on discovering a tiger under the dining table; it was because he knew instinctively that somewhere in this story lay the kernel of what true 'dignity' is.\" \n \"What do you think dignity's all about?' The directness of the inquiry did, I admit, take me rather by surprise. 'It's rather a hard thing to explain in a few words, sir,' I said. 'But I suspect it comes down to not removing one's clothing in public.\" \n In the end, Stevens breaks your heart in two ways: he missed out on the love of his life, AND he realizes that he dedicated his life to serving a man who in the end wasn't the great man he thought he was. Good reminder: prioritize love first. And work on things that matter. \n Another aspect I loved is just learning about the era and how things in England worked. Fascinating for instance that multi-day stays at large estates were the only way to get a bunch of people together to communicate on an issue. Today, we communicate in very different ways. Seems appealing to try that way. \n I'll conclude this with another of my favorite quotes from the novel: \n You've got to enjoy yourself. The evening's the best part of the day. You've done your day's work. Now you can put your feet up and enjoy it. That's how I look at it. Ask anybody, they'll all tell you. The evening's the best part of the day.", "date_added": "Tue May 14 14:30:29 -0700 2013", "date_updated": "Wed Mar 22 11:36:39 -0700 2017", "read_at": "Tue Jan 12 00:00:00 -0800 2016", "started_at": "Sat Jan 02 00:00:00 -0800 2016", "n_votes": 44, "n_comments": 6}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "16033093", "review_id": "4ae04876a9b306d9dfd966060a981d63", "rating": 4, "review_text": "A thought-provoking book about what makes people succeed. I thought it would be useful as a parent, but it wasn't really focused on children at all - it was more about our education system. \n It was interesting to me that it could be proven that getting a GED had no positive correlation on future success. It was even more interesting that they could correlate adverse childhood experiences to negative adult outcomes. Stress, it turns out, is very harmful especially to younger people. Stress activates a physiological system in our bodies that evolved in order to deal with physical emergencies, but we turn it on for months and years on end, worrying about mortgages, relationships, and other such stuff that comes with a stressful life. It was interesting that the primary way to battle stress in young ones is having a good mother, who hugs/touches her kids a lot. \n A lot of the rest of the book was examining various qualities of successful kids. It seems we are early in our understanding of this issue, but it was interesting learning about all the thinking and experiements that have been done. I think this quote sums up the best thesis of where we are: \n \"The idea of building grit and building self-control is that you get that through failure,\" Randolph told me. \"And in most highly academic environments in the United States, no one fails anything.\"", "date_added": "Tue May 14 14:30:11 -0700 2013", "date_updated": "Tue Dec 24 04:11:48 -0800 2013", "read_at": "Fri Jul 26 00:00:00 -0700 2013", "started_at": "Mon Jun 17 00:00:00 -0700 2013", "n_votes": 4, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "10294362", "review_id": "5df5a497442fc2ecb04ca10eb5f8921a", "rating": 5, "review_text": "** spoiler alert ** \n The conclusion to the epic of Hyperion, and a worthy one at that. I loved this series, and didn't expect I'd find the love story of Aenea and Raul so powerful. \n In two words, this series was about evolution and love. \n The Hyperion story is Yet Another Science Fiction Story About Artificial Intelligence (YASFSAAI) - but it's a damn good one, and more thought out and intricate than any I've ever seen. The Core is split into factions - the TODO - that fight and war amongst themselves, much as humans do. \n The Core evolved from people. Core entities lacked empathy - or the ability to love - and were thus never able to evolve past being a parasite on humanity. The farcaster network was their first parasitic approach, the cruciforms were their second. \n \"Thus evolved some members of the Core---not altruists, but desperate survivalists who realized that the only way ultimately to win their never-ending zero-sum game was to stop the game. And to stop the game they needed to evolve into a species capable of empathy.\" \n It's kind of sad that the Catholic Church is the evil character in the book. But is equally clear that after a great traumatic event like the Fall of the Farcasters, humanity turns to fear and uncertainty, and thus to religion. Unfortunately, the people in charge of that religion are the wrong sort, whose goal is power rather than the good of humanity. \n The curiously named \"Void Which Binds\" is the true all-encompassing force in the universe. It is described in the following quotes: \n \"Aenea heard the music of the spheres. She resonated with the Void Which Binds, which resonates in turn to sentient life and thought, and then she used the almost illimitable energy of the Void to ... to take the first step.\" \n \"That's what writers and artists and creators do, boy. Listen to the Void and try to hear dead folks' thoughts. Feel their pain. The pain of living folks too. Finding a muse is just an artist or holy man's way of getting a foot in the Void Which Binds' front door. Aenea knew that. You should have too.\" \n The one thing I never understood about this series is the Shrike. Why does he exist? In earlier books he's an evil entity. And now we learn something more about his relationship with Colonel Kassad, but not enough to explain his presence or why Aenea is able to rein him in - he almost becomes a good guy. \n The thing I love most about this book, is that the true path, which Aenea is leading humanity on, can only be explained as a love story. Her and Raul's love is a worthy and necessary ending to The Cantos. \n \"To see and feel one's beloved naked for the first time is one of life's pure, irreducible epiphanies. If there is a true religion in the universe, it must include that truth of contact or be forever hollow. To make love to the one true person who deserves that love is one of the few absolute rewards of being a human being, balancing all of the pain, loss, awkwardness, loneliness, idiocy, compromise, and clumsiness that go with the human condition.\"", "date_added": "Sun Mar 10 13:59:07 -0700 2013", "date_updated": "Tue Jun 18 13:12:59 -0700 2013", "read_at": "Mon May 06 00:00:00 -0700 2013", "started_at": "Sun Mar 10 00:00:00 -0800 2013", "n_votes": 2, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "6486483", "review_id": "2572877d330e0081681ca843d3dc1563", "rating": 0, "review_text": "Good article by this author: http://www.forbes.com/sites/travisbra...", "date_added": "Wed Feb 27 14:07:26 -0800 2013", "date_updated": "Mon Sep 29 09:34:33 -0700 2014", "read_at": "", "started_at": "", "n_votes": 7, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "3977", "review_id": "132c7d8324998dd01116827c014fa622", "rating": 4, "review_text": "I really enjoyed this book. Some people told me that book 3 wasn't the match of books one and two, but I really quite enjoyed it. I'm struggling to put my finger on it, but I think the dynamic of Raul, Aenea, and A Bettik was a strong one - they clearly cared for each other, and you could see that they would even love each other in the future. \n It had all the elements of a great epic: strong heroes on a mission that is important to humanity, an evil empire trying to stop them, and a mysterious force in the universe trying to help them. The world is almost 300 years after the fall of the farcasters, and is described in such a way as to almost be nostalgic. The hawking mat, all the characters and elements of Cantos, the consul's ship, etc. \n One of the major themes of the book seems to be how the universe can be incredibly harsh. This quote captures it nicely: \n \"The universe is indifferent to our fates. This was the crushing burden that the character took with him as he struggled through the surf toward survival or extinction. The universe just does not give a shit.\" \n And I just loved this one: \n \"I remembered Grandam telling me about an early Old Earth scientist, one Charles Darwin, who had come up with one of the early theories of evolution or gravitation or somesuch, and how--although raised a devout Christian even before the reward of the cruciform--he had become an atheist while studying a terrestrial wasp that paralyzed some large species of spider, planted its embryo, and let the spider recover and go about its business until it was time for the hatched wasp larvae to burrow its way out of the living spider's abdomen.\" \n In harsh times, people often turn towards religion. Fascinating to see that after the Fall, after all the chaos and war and death that ensued, it was the Catholic church that rose to power, and goes onto to rule the universe. People are comforted by its ability to make the universe safe for them with the power of the cruciform. \n One of the themes of the book is definitely fear. Fear of death in particular. De Soya fears each death he has, Raul came close to death on Mare Infinitus with the sharks. The Chitchatuk were interesting here - having to live a particularly fearful life, dependent on the thing that eats them for food (artic wraiths). \n But love is the counter to the theme of fear. We keep getting hints that Aenea is the missionary from the human god and will show us all a better path through love. Raul follows her because he believes in her - and it's clearly foreshadowed they will love each other.", "date_added": "Fri Feb 01 02:12:56 -0800 2013", "date_updated": "Mon Feb 18 11:36:06 -0800 2013", "read_at": "Sat Feb 16 00:00:00 -0800 2013", "started_at": "Sun Feb 10 00:00:00 -0800 2013", "n_votes": 6, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "13453029", "review_id": "46a6e1a14e8afc82d221fec0a2bd3dd0", "rating": 4, "review_text": "A fun fast paced book that sucks you in right away and doesn't let go. The remnants of humanity live in a 150 story silo below the earth and can't leave as the outside is now toxic. This is a bit of an odd thing to have happened, but it gives us a nice palette to think about things. \n Everything is rationed, including how many children you can have. People self-identify by their profession and where in the silo they live: farmers and mechanics in the lowers, IT in the mids, and professional class in the uppers. The working class wear color coded uniforms to easily distinguish them. \n The book was a lot about control. How to control a contained civilization, and give them hope (eg a live feed of the outside) and yet keep them in harmony and doing their functions. Strange mechanisms of control were built all over the silo: communication was oddly limited given the IT resources they have - many messages had to be delivered by courier as emails cost valuable money to send. Most strange of all - there is no elevator, which forces anyone wanting to travel the length of the silo to spend 2-3 days on the journey. \n The cleaning ritual was a strange bit of culture. Upon reflection, I can see why it was necessary. If people never go outside, uncertainty of it still being bad would creep in, and people would need to try it. As perhaps happened in Silo 17. \n I really liked the unraveling of Bernard, and how he went from repulsive/annoying, to understandable once you understood his role and responsibility. His role is to eliminate any doubt in the delicate balance of the silo. Opening the book up with the doubt of Holston was brilliant as it sucked you in immediately. \n I liked Juliet too - she was the right combo of being determined to do right, and having brains and grit.", "date_added": "Tue Dec 04 11:12:22 -0800 2012", "date_updated": "Sat Jul 26 11:43:28 -0700 2014", "read_at": "Tue Jul 08 00:00:00 -0700 2014", "started_at": "Wed Jul 02 00:00:00 -0700 2014", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "11869272", "review_id": "951c71d8b6a2aabd7d27b0e4c1d9d309", "rating": 4, "review_text": "A fascinating and heart-wrenching look inside a slum of Mumbai. A good reminder some of us have it much better than others - but also that human willpower still matters. \n One of the most interesting things portrayed was just how different the rules are for the poor in India. When your family is one bad hospital bill away from being on the streets and starving, human life takes a different value. The story that stuck with me here is when one of the boys got hit by a car on his way to school, his mothers reaction was fury - because if it were any worse it would have bankrupted the family. This quote sums it up well: \n \"It seemed to him that in Annawadi, fortunes derived not just from what people did, or how well they did it, but from the accidents and catastrophes they dodged. A decent life was the train that hadn't hit you, the slumlord you hadn't offended, the malaria you hadn't caught.\" \n Another way the rules are different is that the government is totally corrupt. Pretty hard to get ahead when everyone who can bribe you has got their hand out. \n \"The Indian criminal justice system was a market like garbage, Abdul now understood. Innocence and guilt could be bought and sold like a kilo of polyurethane bags.\" \n But my favorite part of the book was seeing how entrepreneurial people had to be in order to survive. Whether its sorting garbage, being a garbage middleman, or any of the other pursuits various people did to make money, it seemed that at least in one respect the rules of the slum are the same as everywhere else: you've got to work hard and be good at what you do to get ahead. It's just that in the slum, it's so easy to lose it all. Poverty begets poverty, wealth begets wealth.", "date_added": "Sat Nov 24 08:56:05 -0800 2012", "date_updated": "Wed Mar 22 11:39:46 -0700 2017", "read_at": "Mon Dec 10 00:00:00 -0800 2012", "started_at": "Sat Nov 24 00:00:00 -0800 2012", "n_votes": 7, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "40955", "review_id": "299706d01666058b1fb2a96b29a1260b", "rating": 5, "review_text": "A truly inspirational book by a truly inspirational man. Coach Wooden coached 17 seasons at Indiana and UCLA before winning a championship - and then he won 10 out of the next 12! He is one of the greatest coaches ever, and Reading his book gives some great insights into his philosophy. \n My only criticism of the book is that I think he spent too much time comparing his players, and answering questions like \"who was your greatest player\". I guess he got those questions a lot, but it didn't add much for me. \n One of his top values was conditioning. He thought games were often or largely out of his control as a coach, but what was in his control was how conditioned his team was, and he made a point to have the best conditioned team out there. In fact, he often refused to call timeouts in key situations, banking on his teams conditioning down the stretch. As he said, \"ninety percent of the time the game will be decided in the last 5 minutes\", and of course the better conditioned team will make less mistakes in that time. \n If any one premise typifies my teams in all the years I've coached, it is this concept. Often as a player, I'd tell myself, \"I may play someone better than I am, but I'll never run against one who is going to be in better condition\" And I never played against a man in my life I felt was in better shape, and Lambert often cited me as an example of top conditioning.\" \n Another key aspect of Wooden's philosophy was that he believed the little things, the details, really mattered. Two examples of this: First one was that one of the first things he taught new players was how to properly put their socks and shoes on. It turns out, you can easily do it wrong, which leads to blisters - but kind of amazing to think of him teaching Kareem or Bill Walton how to put their socks on! The second was he really believed in strict discipline and cleanliness - for instance he believed in the team cleaning up a locker room before leaving. These little details would \"establish a spirit of togetherness and consideration that help unite the team into a solid unit.\" \n Wooden believed in focus, and \"playing your game\": \n \"In game play it was always my philosophy that patience would win out. By that, I meant patience to follow our game plan. If we believed in it, we would wear the opposition down and would eventually get to them. If we broke away from our style, however, and played their style, we would be in trouble. And if we let our emotions, rather than our reason, command the game we would not function effectively.\" \n Interestingly, Wooden didn't believe in \"charging teams up on an emotional level\", as many coaches do. In fact, I bet most people that that giving inspirational, charged up speeches is one of the key attributes of a great coach. So this was interesting - and helpful in a lot of ways - people respond more to confidence and having a plan. \n One tactically smart thing Wooden did right before he started winning championships, was to change his practices from having 5 starters vs 5 second team, to 7 or 8 first teamers vs the rest. The first team during practice was literally a rotation between those 7 or 8. This got the key bench players used to playing with the first team, and made a world of a difference. \n But I think my favorite takeaway from the book, was Wooden's philosophy on what to ask of his players. He didn't ask them to win. He asked them to strive to have a \"perfect practice\", or a \"perfect game\". In other words, to play to the very best they can in the given moment. While that may sound obvious, keeping his teams focused on that instead of winning likely made the difference. It's all too easy to start focusing on winning or losing or things that aren't in the moment. \n \"When I was teaching basketball, I urged my players to try their hardest to improve on that very day, to make that practice a masterpiece. \n Too often we get distracted by what is outside our control. You can't do anything about yesterday. The door to the past has been shut and the key thrown away. You can do nothing about tomorrow. It is yet to come. However, tomorrow is in large part determined by what you do today. So make today a masterpiece. You have control over that. \n This rule is even more important in life than basketball. You have to apply yourself each day to become a little better. By applying yourself to the task of becoming a little better each and every day over a period of time, you will become a lot better. Only then will you will be able to approach being the best you can be. It begins by trying to make each day count and knowing you can never make up for a lost day.\" \n ps. I also loved how he had a secret signal with his wife before every game.", "date_added": "Sun Nov 18 16:31:28 -0800 2012", "date_updated": "Wed Dec 21 10:43:14 -0800 2016", "read_at": "Fri Apr 17 00:00:00 -0700 2015", "started_at": "Mon Apr 06 00:00:00 -0700 2015", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "16008171", "review_id": "b918d4267614c4d97cd685147e515a57", "rating": 5, "review_text": "A fantastic continuation of Fall of Giants - couldn't put it down. Great to see the same characters back, including their children.", "date_added": "Sun Sep 09 08:33:39 -0700 2012", "date_updated": "Sat Jan 11 10:12:26 -0800 2014", "read_at": "Sun Jan 05 00:00:00 -0800 2014", "started_at": "Mon Dec 23 00:00:00 -0800 2013", "n_votes": 2, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "12953520", "review_id": "8666dfd554e310084c4bc72b2d357f3d", "rating": 4, "review_text": "A hilarious romp through the known and unknown universe that exposes how ridiculous much of US copyright law is. Written by the founder of Rhapsody, who knows a thing or two about music and the copyright surrounding it. What I didn't expect from a book by an entrepreneur is a funny book - and this book is not bad. It is being compared to Hitchhikers Guide, which nothing can approach, but its not bad. My only gripe would be there are a ton of footnotes that attempt to extend the humor and most of them didn't work for me. \n The basic premise of the book is brilliant; that aliens have been listening to - and thus pirating - our music since 1977, without our knowledge. Because US copyright law states that a single case of intentional copyright violation can be fined $150,000 - this means the entire universe is many times over in debt to humanity. \n It's pretty ridiculous that the music industry got such a big fine to be passed. I think one of my favorite parts of the book was learning about the law firm that Nick Carter works for, and seeing a little under the hood of how they operate. \n Overall a fun, enjoyable read.", "date_added": "Tue Jul 10 20:26:21 -0700 2012", "date_updated": "Wed Sep 12 23:32:04 -0700 2012", "read_at": "Mon Sep 10 00:00:00 -0700 2012", "started_at": "Tue Sep 04 00:00:00 -0700 2012", "n_votes": 1, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "13239822", "review_id": "a582bfa8efd69d453a5a21a678046b36", "rating": 3, "review_text": "This book has a great premise, and is full of some beautifully written prose. It's about a hacker during the Arab Spring, helping people get around the firewalls that the State erected to control its population. Alif falls in love, finds an ancient book, gets into trouble with State, enlists the help of an unseen, magical world full of creatures call Jinn, and combats evil. The story flowed well, and was a fast, fun read. \n I would have given it a higher rating, but I'm a computer programmer, and for a book that is about hacking the descriptions of Alif coding felt like I was watching one of those movies where they used a bunch of made-up visuals that have nothing to do with hacking. The prose around the hacking was so oddly descriptive you didn't know what to make of it. For instance, when Alif is hacking into State's intranet, it is described as: \n \"The Hand roused. It lumbered to its feet, reeking of ionized air and dry metallic bones, revealing a level of functionality Alif had not detected. He reeled backward, recalibrating. Breaching the confines of the State intranet, the Hand began to attack the base of Alif's tower, slicing away layers of code through a mirroring protocol of a kind Alif had never seen before.\" \n I didn't know a computer program could \"reek of ionized air\" - and can't conceive of how a mirroring protocol (if there is such a thing) could ever be used to \"slice away layers of code\". \n I wanted so hard for the bit about quantum computing and encoding the ancient story into code to make sense. But it just didn't. And that was the heart of the story - that the ancient text contained an all-powerful computer algorithm. I also had trouble buying the Alif & Dina relationship - the characters just felt shallow to me.", "date_added": "Mon Jul 02 16:04:16 -0700 2012", "date_updated": "Wed Mar 22 11:32:20 -0700 2017", "read_at": "Wed Aug 15 00:00:00 -0700 2012", "started_at": "Sun Aug 12 00:00:00 -0700 2012", "n_votes": 7, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "9850443", "review_id": "9f35b253416fdc0c1aa9774791cb3015", "rating": 3, "review_text": "A fun, dark, slightly comical western about two killers (Charlie and Eli Sisters) on their way to California for the gold rush. Going into the mind of a killer is a strange experience - I'm not sure I totally enjoyed it. But what I did really enjoy was the authors writing; it was clean, fun, and even poetic - which made this book a quick enjoyable read. \n I loved all the introspective one-liners that Eli kept throwing out. For instance: \n \"but I could not sleep without proper covering and spent the rest of the night rewriting lost arguments from my past, altering history so that I emerged victorious.\" \n \"I thought, When a man is properly drunk it is as though he is an a room by himself--there is a physical, impenetrable separation between him and his fellows.\" \n Here is another miserable mental image I will have to catalog and make room for.\" \n \"It is true, I thought. I am living a life.\" \n \"The effects of her words stung me, and after she stole away I stood a long while before her looking glass, studying my profile, the line I cut in this world of men and ladies.\" \n I struggled however to find the point of this novel. What lesson was I meant to take away? What did we learn from Charlie and Eli's adventure? I suppose if anything the theme of the book was transformation. We witnessed Warm, Morris, and Eli have the courage to transform themselves and change their lives. In other words - it's easy to let life dictate your path. Eli's story of how Charlie sucked him into a life of crime was fascinating. Warm had a similar story of how he became a thief. We didn't learn about Morris's past, but we did see the difficulty of his decision to leave the Commodore's employment. It takes guts to transform oneself - especially for the better.", "date_added": "Tue Jun 05 23:21:47 -0700 2012", "date_updated": "Sun Aug 05 12:22:17 -0700 2012", "read_at": "Sat Aug 04 00:00:00 -0700 2012", "started_at": "Fri Jul 27 00:00:00 -0700 2012", "n_votes": 2, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "7315573", "review_id": "02074d27e40cee64a9d5195fb06179e6", "rating": 4, "review_text": "A fascinating story of world war one. I knew the basics, but it was fascinating to hear the story told through some of the characters involved, and see how it all played out. \n On the surface, WW1 was started pretty stupidly. The arch-duke of Austria was assassinated, so in retaliation Austria invaded Serbia. Serbia had an alliance with Russia so they stepped in, and then Germany had an alliance with Austria, so suddenly Germany and Russia were at war. Russia and France had a treaty and since they surrounded Germany, the Germans went on the offensive in France, which dragged in Britain. And then the US got dragged in later by Britain and b/c Germans were sinking our ships. \n But there was more to the story. These countries didn't have to honor these treaties - they could have found a way to not commit to a war. It's almost like they were all war hungry. Follett also tried, through some of the female characters like Maud, to indicate that if the world had been controlled by women then war would never have happened (probably true). This was a great quote: \n \"In every country, those who were against war had been overruled. The Austrians had attacked Serbia when they might have held back; the Russians had mobilized instead of negotiating; the Germans had refused to attend an international conference to settle the issue; the French had been offered the chance to remain neutral and had spurned it; and now the British were about to join in when they might easily have remained on the sidelines.\" \n One issue of the war I hadn't considered was the financial pressures it brought to bear once a country had committed. This was brought up artfully by Ethel's husband Bernie. Once Germany, Britain, etc had declared and spent a ton of money building their army and fighting the war, they were stuck. The people in power - the aristocracy - needed to win or they would go bankrupt and risk losing power. They were pot-committed, and too proud to turn back. \n \"And what if Britain lost? There would be a financial crisis, unemployment, and destitution. Working-class men would take up Ethel's father's cry and say that they had never been allowed to vote for the war. The people's rage against their rulers would be boundless.\" \n My one criticism of the book was that the character Fitz was made out to be a real simpleton. Ethel and Billy seemed to intellectually walk all over him and he never defended himself (or it was left out) - didn't seem terribly realistic. \n I think my favorite part was learning about the Bolshevik revolution - that was a piece of history I really didn't know enough about, and it was described in great detail through Grigory and his story. Czar Nicholas II fell from power during the war, and the Bolsheviks staged a revolution and took over. But its hard to control a country! \n \"A baby was like a revolution, Grigori thought: you could start one, but you could not control how it would turn out.\" \n The class struggles in England, Germany and Russia were clearly a major theme to the book. In each country Follett was careful to show how the aristocracy were fools and didn't know what they were doing. It really highlighted why a democracy is a better way of doing things!", "date_added": "Sun Jun 03 11:22:13 -0700 2012", "date_updated": "Wed Mar 22 11:47:12 -0700 2017", "read_at": "Sun Jun 24 00:00:00 -0700 2012", "started_at": "Tue Jun 12 00:00:00 -0700 2012", "n_votes": 6, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "12969594", "review_id": "3e31f26463b536d280c5100e473feb83", "rating": 3, "review_text": "This book takes us into the crazy world of North Korea. Imagine a world where the government controls all information and creates a ton of propaganda. There are loudspeakers in every home that tell this propaganda every morning and every evening. Everyone believes their leader is a saint, that the rest of world (especially Americans) are out to get them and could sneak attack at any moment, that South Korea and America are more poor than they are and thus the Dear Leader is sending them food for aid, and on and on. \n The books tells the story of Jun Do, who grows up in an orphanage as the son of the Oprhan Master, and while he claims he's technically not an orphan, it's clear that in effect he is. Orphans are portrayed as lost souls, the bottom of the ladder in society, and always on the search for a father-figure. The first half of the book tells a fairly normal story of Jun Do doing work for his country. \n Jun Do had training to withstand pain, ostensibly in case the South Koreans or Japanese captured him. I found the tidbits mentioned around this very interesting - though not sure how accurate they are. One was to establish a place in your mind with lots of light, and don't leave it, no matter how much pain. The other, which I think sounds useful in general, is more for prisoners or any cooped up, and is summed up in this quote: \n \"Use your imagination only on the future, never on the present or the past.\" \n The second half of the book was completely different from the rest of the story, and it was so out of left field and odd that I didn't enjoy it as much. Jun Do assumes the identity of Commander Ga and gets the most beautiful woman in North Korea to accept him? Really? I didn't really like the story being told from the interrogators point of view either. But I did like learning more about Sun Moon - especially her relationship with the Dear Leader. \n Another criticism is that a lot of the dialogue read like it was people in America chatting. A Korean friend also noticed this - it didn't feel very Korean in many places - and thus didn't feel very authentic. \n But what I loved most about the book was just the glimpse into North Korea. It's amazing how complete a people can be controlled if you can control their information inputs. I loved the part when they visit America and the Americans keep whispering \"You know you lost the war, right?\" - because they knew the North Korean government tells it's citizens they won. \n I wonder if the internet has changed things? There are a few members of Goodreads who put North Korea as their country - but we have zero traffic from that country, so perhaps they are all expats/escapees. \n I'll leave you with my favorite line from the book: \n \"'The next day, she was silent. For breakfast, she murdered an onion and served it raw.\"", "date_added": "Mon Jan 16 09:53:05 -0800 2012", "date_updated": "Fri Sep 14 21:09:27 -0700 2012", "read_at": "Thu Mar 22 00:00:00 -0700 2012", "started_at": "Sun Mar 11 00:00:00 -0800 2012", "n_votes": 9, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "5572634", "review_id": "9c332dc5b58a7ecc71669d7a9fce5515", "rating": 5, "review_text": "I loved this book. Although it was a beast of a book, and could probably have been a lot shorter. I had not read a Lincoln biography before, so was firstly blown away by how he rose up from nothing, self-taught himself a college degree, and then somehow rode the middle line and got himself elected President. Nobody seemed to have expected that, nor expected much from him, and he continued to surprise them all. \n I am always curious about the motivations of successful people. In Lincolns case, he just literally seemed to want to have the respect of his peers, and of the American people. \"Every man is said to have his peculiar ambition,\" he wrote. \"I have no other so great as that of being truly esteemed of my fellow men, by rendering myself worthy of their esteem.\" \n Lincoln's tactic to make his enemies his cabinet was also interesting and ultimately brilliant. Especially because he was so unknown, but also because they were the strongest options, and would be hard for him to manage. The confidence he had was impressive. Lincoln constantly showed this higher level of trust in people that many wouldn't have given because it didn't make themselves look good. Hiring people who are smarter than you, and giving them credit when things go right, is very hard to do. \n But Lincoln could afford to trust his people and even hire people like Chase, who was on his staff yet coveted his job, because he was a masterful tactician. He seemed to have a knack for how to position things to the public at the right times to achieve the right outcomes. The main example of this is of course holding back the proclamation of emancipation so the border states didn't slip into the war on the side of south - but there were many more examples. \n One thing that surprised me was how lax access to the white house and president were back then. You could literally just walk into the White House and get in line to see the President. And he seemed to only have one security guard - who happened to be \"off-duty\" the night he was killed. \n I think Lincolns main strength was his empathy. He spent a lot of time trying to understand the people of different states, and putting himself in their shoes and imagining how they felt given what they knew about the situation. A tough, tough thing to do as his whole presidency was during a civil war during which over 600,000 soldiers died. I can't imagine having that on your conscience and trying to internalize that. But a very valuable skill to have as a leader. \n \"Lincoln had internalized the pain of those around him--the wounded soldiers, the captured prisoners, the defeated Southerners. Little wonder that he was overwhelmed at times by a profound sadness that even his own resilient temperament could not dispel.\"", "date_added": "Fri Jan 13 13:32:28 -0800 2012", "date_updated": "Thu Oct 19 11:54:40 -0700 2017", "read_at": "Wed Dec 04 00:00:00 -0800 2013", "started_at": "Mon Jul 15 00:00:00 -0700 2013", "n_votes": 19, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8296156", "review_id": "e12db200e38529e3aae7dca5ecc7acd6", "rating": 3, "review_text": "This is a fascinating glimpse into American history, of which I was largely ignorant - well worth a read. I had no idea prohibition lasted 14 years! My only criticism is the author spent way too much time on the politics of prohibition - that could have been cut by half. \n The bottom line of prohibition is that is was a massive failure. It singlehandedly created organized crime, cost the government lots of money in lost taxes and enforcement, and failed to stop pretty much anyone from drinking. \n It did have some upside though. Americans had a drinking problem and definitely drank less overall during prohibition, and even afterwards. But more importantly prohibition helped transform American culture. Prohibition coincided with massive immigration and population growth, which all happened in the cities. It was really a battle between urban culture and rural culture. It particularly didn't make sense in urban culture, and people rebelled, giving us \"the roaring 20's\". Prohibition helped us go from a stay at home culture to one where it was acceptable to go out and consume liquor. \n Prohibition gave us income tax. The Anti-Saloon League (ASL), which was the organization that pushed prohibition through, pushed income tax through first because the government couldn't approve prohibition without finding an alternate source of revenue for the massive amount of tax money (30% of federal revenue) it made on liquor. \n Many businesses got their starts in prohibition. Walgreens went from 20 to 525 stores during prohibition, because of the legal loophole that medicinal liquor was allowed, so drugstores were a major source of liquor sales. Coca Cola saw sales triple. The entire ecosystem of Nassau and the Bahamas was created. Sam Bronfman, the largest bootlegger in Canada, turned his operation into a legitimate business afterwards, owning many major liquor brands under the Seagrams brand. \n The major failing of prohibition, and the reason it was eventually repealed, was the organized crime. Al Capone was the poster boy, but all the major mafia families got their start bootlegging, then got organized, then went on to bigger and better criminal activities. Yes it gave us Las Vegas, but it wasn't a good thing. If anything, this is the argument for the legalization of Marijuana (though there are other factors there). \n In the end I think that prohibition was a bad idea because it was the government trying to tell Americans how to live. Individuals have to take responsibility for themselves.", "date_added": "Wed Nov 23 11:12:07 -0800 2011", "date_updated": "Sat Jan 04 19:46:42 -0800 2014", "read_at": "Mon Jan 02 00:00:00 -0800 2012", "started_at": "Tue Nov 29 00:00:00 -0800 2011", "n_votes": 8, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8664353", "review_id": "da2d4cfce836a2c57ad55c38437aa692", "rating": 5, "review_text": "Wow. Amazing story, and well told - kept me up late at night! Louie Zamperini truly went through hell and came back - and it's inspiring to read a story of such willpower and determination. It was also interesting to me to learn more about Japan and their role in the war. \n One big takeaway was just how cheap human life is in war. I think there was some stat about how 5/6 of the US airmen that died did so from accidents - that is simply staggering. \n I love WWII stories, but most of the ones I've seen and read have focused on Germany, so I really didn't know much about how Japan had treated their POW's. It was pretty eye opening to read the stats about how they pretty much massacred hundreds of thousands of POW's. And of couse, as the story details, they also did not follow Geneva Conventions and pretty much treated POW's as slaves. \n One of my favorite points the author made is best illustrated by this quote about Dignity is as essential to human life as water, food, and oxygen. This is a fundamental truth of humanity that the author really drew out well - if you take a persons dignity away you take everything away. I loved all the stories of POW's being defiant; stealing food, supplies, playing jokes, etc. The little bits of defiance were enough to let them take back their dignity, and I think thats what makes them so compelling; because while we haven't all been POW's, we can relate to that basic need.", "date_added": "Sun Nov 20 09:10:15 -0800 2011", "date_updated": "Wed Mar 22 11:47:04 -0700 2017", "read_at": "Wed May 16 00:00:00 -0700 2012", "started_at": "Sun May 06 00:00:00 -0700 2012", "n_votes": 50, "n_comments": 4}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "7632329", "review_id": "abe5300e71a4d3dd0ca63c002a608c09", "rating": 0, "review_text": "Peter McCarthy recommends", "date_added": "Fri Nov 18 20:24:58 -0800 2011", "date_updated": "Wed May 27 09:30:13 -0700 2015", "read_at": "", "started_at": "", "n_votes": 2, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "12727969", "review_id": "ed084fe1710292ba3f3b332d4debd5b2", "rating": 0, "review_text": "http://www.thedailyshow.com/watch/tue...", "date_added": "Wed Nov 09 20:05:24 -0800 2011", "date_updated": "Wed Nov 09 20:05:53 -0800 2011", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "11297044", "review_id": "b3e759490ba6aa0f083829813ed39ffa", "rating": 5, "review_text": "This is an amazing inside view into the life of one of the great businessmen of our era. A must read. \n The thing that struck me most about Steve Jobs was that he was an incredible perfectionist. He was a craftsman, and wanted the computers he built to be beautiful and amazing and useful. He believed that computers were \"at the intersection of technology and liberal arts\" - a phrase he used a lot - because he realized computers weren't just for geeks. They are for everyone, and needed to be able to be used by everyone. \n Steve put design at the top of product pyramid at Apple - above engineering. This means they spent a lot of time trying to fit the hardware into the beautifully designed cases the designers came up with, and the designers and engineers had to work together closely. This can backfire (eg Antennagate), but largely it worked really well. It produced amazing computers that were visually distinct from everything else in the market, and that \"just work\". If I learned anything from this book, it's that Apple believed that design is paramount, and spending extra time and engineering resources to make a beautiful design work is worth it. \n Apple's design philosophy is to \"make it simple. Really simple\". You still see this today - go to Apple.com - you will see ONE product. Now try Amazon. According to the book, Jobs learned this from Markkula, who taught him that \"A great company must be able to impute its values from the first impression it makes\". \n Steve's ethos was basically that if you are going to do something, do it right. The book is full of examples of Steve doing this. When the iMac first came out it looked like no other computer. It was interesting to hear how difficult it was for the engineers to accommodate a handle on the computer - but it ended up being a defining feature of the computer. I also loved the story of how Steve was obsessed with quality glass, and ordered the highest end stuff he could find for his Apple Stores. \n Steve's management tactics got a lot of scrutiny in the book - and many other reviewers use words like \"jerk\" to describe him. It sounds like Steve could definitely be a jerk to work for. His management style was to push people as hard as he could, and to let people know when they didn't perform. When pushed like that, a person can have one of two reactions: they either resent it, and end up quitting or getting fired (B-players) - or they accept the challenge to do better, and come back the next week with something even better. Win-win for Steve - he filters out the b-players and gets his a-players to produce the best work they can. \n But, as was pointed out in the book, if Steve was nothing but a jerk, he wouldn't have built a company full of loyal employees - Apple has one of the lowest turnover rates in the valley. Jobs only hired people who \"had a passion for the product\". I also liked how he motivated by looking at the bigger picture; such as the story of how he convinced his engineer that saving 10 seconds off the boot time was worth it because across 5 million users that would save 100 lifetimes per year. \n The book was full of references to Steve's dynamic personality; his \"reality distortion field\" is a great descriptor. Steve believed he could do anything - and he was so persuasive that he could convince those around him that they could whatever it was too. I think this is one of the most defining qualities of an entrepreneur - believing something can be done against all odds. Not being afraid to tear down walls or think outside the box. \n I loved the description of Steve that \"whatever he was touting was the best thing he ever produced.\" You see him do this in his keynote speeches too. He is always using words like \"best\", \"amazing\", etc to describe whatever he's launching. \n A big theme that the author made was that especially early on, Steve viewed Apple as \"counter-culture\" rebels. They were hippies who thought they could change the world. And they did - but not only that - I think they embedded their can-do attitude deep in Silicon Valley, which is probably highly correlated with why it is the center of the technology revolution today. This quote is classic: \n \"The people who invited the twenty-first century were pot-smoking, sandal-wearing hippies from the West Coast like Steve, because they saw differently. The hierarchical systems of the East Coast, England, Germany, and Japan do not encourage this different thinking. The sixties produced an anarchic mind-set that is great for imagining a world not yet in existence.\" \n One of Steve's great abilities was to focus. When Jobs came back to Apple from his hiatus the biggest innovation he made was to focus the company onto just the few products that were working or had potential. \n \"What are the five products you want to focus on? Get rid of the rest, because they're dragging you down. They're turning you into Microsoft. They're causing you to turn out products that are adequate but not great.\" \n Steve's belief that computers need to be beautiful and easy to use basically prevented him from ever licensing his software, as then he wouldn't be able to control the user experience. Microsoft didn't have that problem, and that's why Windows dominated. I think it's also the reason that Windows is in trouble today. They have spent a decade making their code work across hundreds of different hardware configurations. Their code is now full of backwards compatibility support that just makes it messy, and bloated. Worse, their focus is on maintaining all that instead of innovating and improving it. \n The platform vs integrated approach is being tested again with the iphone vs android. It will be interesting to see if history replays itself, or if Apple's lead and ability to make a superior product because of their full stack control will prevail. \n In the end, this was the best quote of the book: \n Stay Hungry. Stay Foolish.", "date_added": "Thu Oct 06 11:03:50 -0700 2011", "date_updated": "Wed Jan 08 04:23:59 -0800 2014", "read_at": "Thu Dec 01 00:00:00 -0800 2011", "started_at": "Fri Oct 28 00:00:00 -0700 2011", "n_votes": 70, "n_comments": 24}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "9418327", "review_id": "ed4fd27c67be9f8359df71b80cf1e017", "rating": 4, "review_text": "A hilarious and book from Tina Fey - definitely worth listening to over audio as she reads it herself. She makes fun of herself a lot, adds lots of light humor, and of course shares TMI. \n The most interesting bit was hearing the behind the scenes of Saturday Night Live, and how she was a joke writer there for 3 years before they gave her a role on the show, which was only doing the news. Her breakout occurred after she had already left for 30 Rock, when she did the Sarah Palin impersonation. Tina is clearly an example of someone who has worked long and hard to get where she is.", "date_added": "Mon Sep 19 16:07:48 -0700 2011", "date_updated": "Wed Mar 22 11:36:26 -0700 2017", "read_at": "Sun Jan 06 00:00:00 -0800 2013", "started_at": "Mon Oct 08 00:00:00 -0700 2012", "n_votes": 9, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "12567957", "review_id": "71f1d0e4d3cb9215bc1d94aad229b218", "rating": 4, "review_text": "This is a fun quick read, but particularly well written, which makes it a great insight into the struggle an author takes to get published. I don't think I learned anything per se, but it's great to see it all put together and told fluidly and so that you empathize with the characters. It almost - almost - makes me want to read the Art of Fielding, despite my lack of love for Baseball.", "date_added": "Fri Sep 09 18:27:49 -0700 2011", "date_updated": "Fri May 25 11:59:45 -0700 2012", "read_at": "Tue May 22 00:00:00 -0700 2012", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "4986701", "review_id": "bb7de32f9fadc36627e61aaef7a93142", "rating": 4, "review_text": "Found the Goodreads down image in this, and many other useful images too!", "date_added": "Thu Aug 04 10:02:02 -0700 2011", "date_updated": "Thu Aug 04 10:02:02 -0700 2011", "read_at": "", "started_at": "", "n_votes": 6, "n_comments": 4}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "62291", "review_id": "e23965adda7ce7e7e415a1339e169065", "rating": 5, "review_text": "** spoiler alert ** \n Loved it. The epic saga continues. The poor Starks are torn apart, but yet are surprisingly resilient. In fact, pretty much every major character is in danger of dying and some even do. It's a bit tough to read, as you really wanted The King In The North to succeed. And Dany is fast becoming an interesting part of the plot that has yet to intermix with the rest of the characters. \n I'll be starting the next one soon. These books are like crack.", "date_added": "Tue Jul 12 12:57:07 -0700 2011", "date_updated": "Wed Mar 22 11:47:02 -0700 2017", "read_at": "Sat Aug 20 00:00:00 -0700 2011", "started_at": "Tue Jul 26 00:00:00 -0700 2011", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "10552338", "review_id": "90d18066f034757da91b8cf49ccc1fb5", "rating": 5, "review_text": "This sounds awesome.", "date_added": "Mon May 23 18:38:42 -0700 2011", "date_updated": "Wed Mar 22 11:46:57 -0700 2017", "read_at": "Wed Sep 28 17:51:00 -0700 2011", "started_at": "Sat Aug 27 00:00:00 -0700 2011", "n_votes": 0, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "6563914", "review_id": "8b96ce2543a5887fe3f0d0b8798b8487", "rating": 5, "review_text": "I first read this ~10 years ago and just re-read it as someone reminded me that it predicts the future of reading. And it does - what I love about Stephenson is his high level of prescient-ness. In fact I think it also predicts a lot of the future of nanotechnology and entertainment. \n The Young Ladies Illustrated Primer is a dynamic book with an AI in it. Imagine Alexa or Siri in 5-10 years, smart enough to make up stories on the fly and answer questions about or even redirect the storyline. The YLIP is designed in the book for a 4 year old girl, Fiona, but Nell and a few other girls end up with them also. Maybe this resonated with me as I have a 4 year old girl and wish this existed for her. What's particularly powerful about this, is the story was able to be adaptive to the problems in Nell's life, and give her strength and confidence at moments when she needed it. Some cool trivia: Project Fiona was the codename for the Kindle. There is now a building at Amazon in Seattle named Fiona. \n One of the pieces of magic of the Young Ladies Illustrated Primer was that for Nell and Fiona's editions, there were live actors (\"ractors\") on the other end, reading all the lines 1 on 1. This put a level of personalization and human connection into the story for the girls that wouldn't have been possible otherwise. Learning about the marketplace of ractors was particularly interesting and it's hard to think such a thing won't exist in 2-5 years as VR takes off. Would you rather watch the movie Harry Potter or live act out the scenes with 2 friends as Harry, Ron, and Hermione, and have professional actors play the other characters? You can imagine this being a big form of entertainment of the future. \n The nanotechnology described in the book was also fascinating. Describing a world of robots and drones too small for the human eye to see, doing tasks and even fighting each other. Massive wars we perceive as \"particularly dusty days\". Poisoning or taking control of another person is as easy as getting them to inhale or injest some nanobots. The drummers were a particularly interesting notion of hive-mind, connecting multiple humans together through nanobots attached to their synapses on their brain. And then of course you have nanobots creating other bots, which led to this great quote: \n \"The Victorian system used Darwinian techniques to create killers adapted to their prey, which was elegant and effective but led to the creation of killers that were simply too bizarre to have been thought up by humans, just as humans designing a world never would have thought up the naked mole rat.\" \n But of course the biggest implication of nanotechnology is the ability to manipulate molecules and thus - given The Feed (which I somehow provides a stream of molecules & energy for manipulation) - you can make anything in a Matter Compiler (MC). This is kind of like what they had in Star Trek, and what 3D printing gives us .0001% of today. \n The book is largely about what would happen to society if MC's were invented and much of the need for farming, manufacturing, etc was eliminated. Poverty would become even more prevalent, as would crime, governments would collapse, and of course, a class divide would emerge as never before, driven by those who have technology and those who don't. And of course, badass engineers like Hackworth will rule the day (kind of). I suppose in a way the book is about the fear of what will happen if technology progresses too far and leaves masses of humans without a purpose in life. Parking lots and chaos. \n \"These were rice paddies before they were parking lots. Rice was the basis for our society. Peasants planted the seeds and had highest status in the Confucian hierarchy. As the Master said, \"Let the producers be many and the consumers few.' When the Feed came in from Atlantis, from Nippon, we no longer had to plant, because the rice now came from the matter compiler. It was the destruction of our society. When our society was based upon planting, it could truly be said, as the Master did, \"Virtue is the root; wealth is the result.' But under the Western ti, wealth comes not from virtue but from cleverness. So the filial relationships became deranged. Chaos,\" Dr. X said regretfully, then looked up from his tea and nodded out the window. \"Parking lots and chaos.\"", "date_added": "Sat May 21 15:06:36 -0700 2011", "date_updated": "Tue Dec 20 00:18:43 -0800 2016", "read_at": "Tue Mar 29 00:00:00 -0700 2016", "started_at": "Fri Feb 19 00:00:00 -0800 2016", "n_votes": 31, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "9938498", "review_id": "bff5654c639c7b008571c3d4398d930a", "rating": 4, "review_text": "Great story of the US Ambassador to Germany and his experience during the build-up of ww2 from 1933 - 1937. Nothing new or exciting really revealed, and I'm sure there are many other accounts of the buildup to ww2 out there, but this one told it from the perspective of mostly the Ambassador, Dodd, and his daughter, Martha. The story was engaging and well-written, and thus interesting. I think the ending fell pretty flat - I was hoping for more. \n Reading about the Nazis one is of course always appalled at how they got to be in power and commit such atrocities, and this book did provide some clues. Hitler seemed primarily willing to tell people what they needed and wanted to hear, even if it wasn't the truth - and he was a great storyteller. He also used fear as a primary weapon, as there were many in Germany not behind him - but they were too afraid to make a stand or speak up. \n I suppose the climax of the book was the Night of the Long Knives, where Hitler arrested and executed all of his major opponents, clearing the way for his absolute grip on the nation. He ruthlessly murdered an estimated 77 to several hundred people (the count was never really known) and played it off as putting down a rebellion, which much of the world bought for many years. \n I think one of the more interesting pieces of the book was watching Dodd (and Martha) go from thinking the Nazis were good for Germany, to realizing how terrible they were and hoping for them to be overthrown. It was a slow gradual process, and one that I'm sure was not immediately obvious to anyone. In the end, I think the book is aptly named.", "date_added": "Sat May 21 15:04:50 -0700 2011", "date_updated": "Wed Mar 22 11:46:56 -0700 2017", "read_at": "Wed Jun 22 00:00:00 -0700 2011", "started_at": "Sat Jun 11 00:00:00 -0700 2011", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "831635", "review_id": "549bc8e5f48d65e981cf2abb3ff7ee6f", "rating": 0, "review_text": "Recommended by our pediatrician", "date_added": "Mon May 16 12:29:47 -0700 2011", "date_updated": "Mon May 16 13:15:30 -0700 2011", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 12}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "11474551", "review_id": "2065145714bf747083a1c9ce81d5c4fe", "rating": 5, "review_text": "A friend sent me this. Hilarious!", "date_added": "Wed May 11 22:38:11 -0700 2011", "date_updated": "Sun Jan 29 15:56:41 -0800 2012", "read_at": "Wed May 11 00:00:00 -0700 2011", "started_at": "Wed May 11 00:00:00 -0700 2011", "n_votes": 5, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "18914012", "review_id": "d27bccd12a000a9831105c73c3240d24", "rating": 4, "review_text": "Super fun book - the story of a sysadmin chasing a hacker during the early internet, but it reads almost like a thriller - fun and fast. \n I think I learned more about the early internet from this book than anything I've ever read before. I had heard of the words Arpanet and Milnet, but really didn't know what they were - simple networks of computers. And apparently, with very poor security! Impressive how easy it was for the hacker to get root access back then. \n Internet security has come a long ways since those days (and has a very long way to go) - but you can really get a sense of how it started and where it's going by reading this.", "date_added": "Fri Apr 01 14:43:51 -0700 2011", "date_updated": "Fri Dec 09 12:03:40 -0800 2016", "read_at": "Fri Jan 01 00:00:00 -0800 2016", "started_at": "Sun Dec 27 00:00:00 -0800 2015", "n_votes": 14, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "478", "review_id": "1ec765c1f244d68cde906b3fa2334151", "rating": 0, "review_text": "Recommended by steve blank", "date_added": "Thu Mar 31 12:46:42 -0700 2011", "date_updated": "Thu Mar 31 12:46:57 -0700 2011", "read_at": "", "started_at": "", "n_votes": 1, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "10139649", "review_id": "76357fd41b3954971b43590fdcb6fdba", "rating": 4, "review_text": "Great story about the founding of Microsoft from it's cofounder Paul Allen. I've read a few books about Microsofts history before (such as Gates), but it was fascinating to hear it from the horses mouth. \n What stuck out for me was that Paul and Bill were on the cutting edge of software ever since they first saw a computer as teenagers. Malcolm Gladwell in Outliers mentioned the fact that having access to a computer at that time was a huge advantage, and Paul's story confirms that. The world only changes massively so many times, and the age of computing has certainly been one of them - and Paul and Bill were in the right place, at the right time, and with the right drive to succeed. \n What was impressive was how Paul and Bill executed like crazy. They had the edge, and they worked really hard, long hours to keep it. It was sad that Paul burned out so early - but also understandable given that Bill had such a strong personality. \n Paul prides himself on being a forward thinker. He gives multiple stories of always following the latest technology and trying to look forward and think about what is coming next. Indeed, it's that trait that led to Microsoft being formed as they were certainly at the forefront of the software revolution. In one part of the book Paul even predicts that Mobile is the next big platform and that the PC is dying. \n I've always worked at startups, which tend to innovate more than they follow. So it was interesting to hear Allen talking about how Microsoft's strategy went from being on the cutting edge of technology in it's infancy to being a 400 pound gorilla that used a approach of copying innovative products and using it's cash reserves and muscle to out-execute on an idea. I suppose this is what a big company has to do - but it's a hard position to win from. An Microsoft really hasn't had a lot of wins lately. They haven't innovated enough on Hotmail. Bing is nice but not better than Google in any significant ways. And even the high and mighty Internet Explorer is really losing ground to Chrome/Firefox/Safari. Paul is right - you have to look to what is ahead. \n Since Microsoft, Paul has certainly stayed busy: owning sports teams, investing in lots of different companies, building a space program, and touring around on his 400 foot yacht. Most of his investments have been in the vein of improving technology and trying to predict the next big things, especially in his particular interests. \n I think his brain mapping project and the Digital Aristotle projects stand out - they sound really interesting and important. The appendix lists a few of the current challenges issues with getting a computer to understand human language, which was fascinating. Allen even alludes to the oft-mentioned Singularity, but says that he doesn't think it will occur in our lifetimes, as despite Moore's law advancing computing power fast enough, we are lightyears away with AI. \n Some useful tidbits: \n - p65 Even Bill Gates wasn't the best at Math in college at Harvard. There are all kinds of smarts! \n - Lesson: decentralize or don't distract the ceo: http://www.goodreads.com/quotes/show/... \n - It was interesting that Allen said that his biggest mistakes were not finding the right people to help him execute his visions. It's all about people. \n Update: my interview with Paul Allen is now live!", "date_added": "Tue Mar 22 00:44:51 -0700 2011", "date_updated": "Mon May 02 18:13:27 -0700 2011", "read_at": "Wed Apr 13 00:00:00 -0700 2011", "started_at": "Wed Apr 06 00:00:00 -0700 2011", "n_votes": 12, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8519525", "review_id": "2f9197113af54bf20b83db1046c3a4ea", "rating": 5, "review_text": "** spoiler alert ** \n A very well written series of short stories. There was no \"main\" character, though I was curious and counted and out of 13 chapters, Sasha was in 5 and and Bennie Salazar was in 4. The story wove and dipped in and out of their lives, and occasionally into surrounding characters. I thought it was a little hard to keep track of all the stories and how they related, though. \n I think Lou was one of my favorite characters. Lou is a stereotypical record producer and ladies man. I loved how he at one point was quoted as saying \"I'll never get old\", and then there was a whole chapter later dedicated to his death. Lou is one of those guys that is immediately likable, even though you know he's probably not a great role model: \"The world is full of shitheads, Rhea. Don't listen to them--listen to me. And I know that Lou is one of those shitheads. But I listen.\" \n If this book has a theme I think it's something to do with how people change as they get older. \"Time is a goon\" was quoted in two different chapters, and if it means \"goon\" as in a thug, then the implication is that time \"beats us up' - or changes us - as our lives go on. We remain the same people underneath, but we are defined by the experiences we have, and the more time we live the more life shapes us into totally different people. \n In the last chapter I loved the concept of the parrots - or people who sell out and endorse a product to create \"authentic\" word of mouth. As someone who is building a social network I think this is an interesting perspective, and one that I think is definitely a trend. It's nothing even new - celebrities have been selling out and taking money to endorse products for a long time. \n But what is new is that celebrities aren't the only ones with followings anymore. Now with Facebook and Twitter and other social networks (yes, even Goodreads), regular people can amass hundreds and even thousands of friends. And maybe instead of paying one celebrity with 100K followers to promote something you pay 100 people with 1K followers. Indeed this is already starting - some friends of mine helped start Ad.ly - which lets you buy celebrities tweets.", "date_added": "Wed Feb 16 17:13:02 -0800 2011", "date_updated": "Sat May 07 19:45:28 -0700 2011", "read_at": "Fri May 06 00:00:00 -0700 2011", "started_at": "Fri Mar 11 00:00:00 -0800 2011", "n_votes": 4, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "38840", "review_id": "06ca1b298256e29833fbc8cfaaf02e38", "rating": 4, "review_text": "A very interesting book about John Boyd, who was a crack fighter pilot, and then later military strategist and reformer. Boyd flew as an instructor in the real life version of Top Gun, and beat everyone in 40 seconds or less. But later in his life he really studied military strategy, and this is where the interesting parts of this book are. \n Boyd was literally the designer of the F-15, and a theory of maneuvering called Energy-Manueverability (E-M), which mathematically gave a chart for each aircraft that gave pilots an idea of the ideal speeds and altitudes they could use to pull off various turns and tactics. \n One interesting thing I noted was that throughout his career, like everyone else in the military, Boyd was getting reviewed by his superiors, called ER's. It was interesting to hear, and relevant to business, how you had to \"read through the lines\" and how even a positive sounding ER could be a career-killer if the person wasn't recommended for promotion. Reading this has definitely made me think twice every time I've read (or written) recommendations for people. \n Another Boyd tidbit I liked was when fighting bureaucratic battles in the Pentagon, he had a mantra to \"use the other persons information against him\". Starting with the other persons argument and data, and working backwards, you can make pretty compelling arguments. \n Perhaps the biggest idea Boyd came up with is what is called the OODA loop, which stands for Observe, Orient, Decide, Act. A key quote defining the OODA loop: \n \"Thinking about operating at a quicker tempo - not just moving faster - than the adversary was a new concept in waging war. Generating a rapidly changing environment - that is, engaging in activity that is quick it is disorienting and appears uncertain or ambiguous to the enemy - inhibits the adversary's ability to adapt and causes confusion and disorder that, in turn, causes an adversary to overreact or underreact. Boyd closed the briefing by saying the message is that whoever can handle the quickest rate of change is the one who survives.\" \n Another great quote that helps explain it: \n \"Boyd said the strategies and bloodbaths of World War 1 were the natural consequence of both the vo Clausewitzian battle philosophy and the inability of generals to adapt new tactics to nineteenth-century technology: line abreast, mass against mass, and linear defenses against machine guns and quick-firing artillery. The bankrupt nature of that doctrine was demonstrated on the first day of the Battle of the Somme, which the British suffered sixty thousand casualties. After more than three years of the meat-grinding form of war, the Germans began engagements with a brief artillery barrage with smoke and gas obscuring their intentions, then sent in a special infantry teams. These small groups looked for gaps in the defense and advanced along many paths. They did not hit strong points but instead went around them, pressing on, always going forward and not worrying about their flanks. They were like water going downhill, bypassing obstacles, always moving, proving, and then, when they found an opening, pouring through, pressing deeper and deeper.\" \n Getting your lieutenants to the point where they can do this kind of infiltration successfully requires great communication and men who can think fast on their feet. In other words, you had to enable every leader to be able to follow the OODA loop, and just arm them with the overal goals, and trust them to make their own decisions. Very different from previous military structures, where \"the need to know\" remained at the top. \n Why is this empowerment valuable? Because: \n \"The key thing to understand about Boyd's version is the not the mechanical cycle itself, but rather the need to execute the cycle in such fashion as to get inside the mind and the decision cycle of the adversary. This means the adversary is dealing with out-dated or irrelevant information and thus becomes confused and disoriented and can't function.\" \n And: \n \"Understanding the OODA loop enables a commander to compress time - that is, the time between observing a situation and taking an action. A commander can use the temporal discrepancy (a form of fast transient) to select the least-expected action rather than what is predicted to be the most effective action. The enemy can also figure out what might be the most effective. To take the least-expected action disorients the enemy. It causes him to pause, wonder, to question.\" \n This makes sense. You can almost picture the commanders of old, who used to have to get on the phone with their boss in order make any decision. \"Take the bridge, blow it up, or wait?\". Hours and days could be spent waiting around for generals to make up their minds. This form of maneuver warfare is what the Germans used in WWII - they called it blitzkrieg - and it's what we used in Iraq the first time. \n In business we have a word for the above - micromanagement. In a sense, it sounds like empowering business leaders and their lieutenants to have an effective OODA loop is what will let a business move faster and win marketshare. I bet somebody has written a book about that - I will have to look.", "date_added": "Tue Dec 21 08:34:04 -0800 2010", "date_updated": "Mon Mar 28 00:32:53 -0700 2011", "read_at": "Sat Mar 26 00:00:00 -0700 2011", "started_at": "Tue Dec 21 00:00:00 -0800 2010", "n_votes": 5, "n_comments": 4}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "43536", "review_id": "bea63c9e3bef94bc581e94ce6a07a3ee", "rating": 4, "review_text": "List of great observations and leadership tidbits. Doesn't give full stories examples behind each, so I found it a little hard to apply or let the lesson synch in. I switched to his auto-biography, They Call Me Coach (see my review) to get those.", "date_added": "Mon Dec 13 15:12:26 -0800 2010", "date_updated": "Wed Dec 14 12:30:43 -0800 2016", "read_at": "Mon Sep 21 00:00:00 -0700 2015", "started_at": "Thu Mar 19 00:00:00 -0700 2015", "n_votes": 6, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "145102", "review_id": "6ca38491139e7c5b4a3c75e52e266c2d", "rating": 0, "review_text": "Regimented by Brian and kyusik", "date_added": "Mon Nov 29 19:17:41 -0800 2010", "date_updated": "Mon Nov 29 19:18:11 -0800 2010", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "6496815", "review_id": "9f1ddbe0f4d8e8f70cbdf2b0fbdf1560", "rating": 0, "review_text": "Eric recommends", "date_added": "Fri Nov 26 21:06:27 -0800 2010", "date_updated": "Wed Mar 22 11:46:50 -0700 2017", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "1707053", "review_id": "01a8f268ac68a12e4feb4713d11925a0", "rating": 0, "review_text": "If I ever go to Peru, this is top of the list.", "date_added": "Thu Nov 11 14:02:27 -0800 2010", "date_updated": "Thu Nov 11 14:02:56 -0800 2010", "read_at": "", "started_at": "", "n_votes": 1, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "6452796", "review_id": "33f25b63a8a5be9b832f706c4c0a1cfc", "rating": 3, "review_text": "Kareem recommends", "date_added": "Fri Oct 08 08:02:15 -0700 2010", "date_updated": "Wed Mar 22 11:46:49 -0700 2017", "read_at": "", "started_at": "", "n_votes": 1, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "211099", "review_id": "b662fcdf0791b3bbccca2d5f1f7b5ba1", "rating": 5, "review_text": "I learned two major things from this book: the power of branding, and the fact that Richard Branson has balls of solid steel. \n Branson is one of the great entrepreneurs of our era, and it was truly inspiring to hear his story in his own words. A kid who skipped college and dove straight into business, and time and time again proved he can succeed with a lot of will, determination, and his maverick ability to take big bets and win. Bransons' success is nothing short of inspirational. \n I had no idea until reading this how powerful the Virgin brand is, or how many businesses they have gone into. They effectively function like a VC, except they also lend their brand (and perhaps some infrastructure too). Each business is a subsidiary, given its leaders the freedom to move fast and achieve their goals without being slown down by needing permission from the mother ship. This is brilliant. Many of the businesses also complement each other in profitable ways - such as how Virgin Travel and Virgin Atlantic complemented each other. \n Branson is a risk-taker. When Virgin Records was about to run out of cash, instead of scraping what he had left to limp on, he scraped it together to make a big bet. It's kind of like going all-in in poker when your chips are getting low - better than losing slowly! \n \"I have always believed that the only way to cope with a cash crisis is not to contract but to try to expand out of it.\" \n But the difference with Branson is that he didn't take the risks blindly. When he started the airlines he spent considerable effort leasing the airline for 1 year and limiting his downside. \n It is only by being bold that you get anywhere. If you are a risk-taker, then the art is to protect the downside.\" \n One thing I loved about Branson, is he was not afraid to bluff. This was first illustrated early in the book when, learning about a plot to force him out of Student, he acted pre-emptively and told the leader that he had already switched the teams mind - when instead he had no idea how far along the plot actually was. We see this time and time again - Branson is able to divine where things are going, and negotiate on points he isn't even wholly sure about. \n Branson detailed a lot of his crazy ballooning adventures, which I wasn't so into. I wanted to hear how he built Virgin. Although I did appreciate that his passion for ballooning did lead to several advances in airplane technology. \n The end of the book went into a lot of detail of how Branson is giving back to the world - which I respect a lot - any billionaire worth their salt should do that, but it was great to see him embrace the challenges with the same zeal he embrace business. From climate change to Virgin Fuel to Virgin Galactic, Branson is thinking hard about our planet and where its going and how to get us there. And of course, if Virgin Fuel does well it will only help his airline business - so not a bad bet.", "date_added": "Mon Oct 04 20:23:11 -0700 2010", "date_updated": "Wed Mar 22 11:46:49 -0700 2017", "read_at": "Sun Jul 22 00:00:00 -0700 2012", "started_at": "Sun Jul 01 00:00:00 -0700 2012", "n_votes": 39, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "612532", "review_id": "3dea47acbe98261b736694e0bcc95b1c", "rating": 0, "review_text": "Just heard a talk by Chip which was very inspirational. He talked a lot about Abraham H. Maslow's hierarchy, and how it can be applied to employees, customers, and investors. Employee pyramid is: salary => recognition => calling. I thought his principles were similar to Tony Hsieh's book Delivering Happiness: A Path to Profits, Passion, and Purpose. He even mentioned this was true, and that Tony and 10 other companies that had great culture had all studied Maslow (Apple, Southwest, Google, Whole Foods, Zappos, etc). \n The top of any pyramid is hard for most business leaders because it's the self-actualization - the intangible stuff, which can't be measured. And most business leaders are taught to run things by the numbers. Told a story to illustrate this about why Southwest doesn't charge fees for checking baggage. It's because they didn't want to make their flight attendants into baggage handlers - which is what happens on other airlines, where everyone tries to carry everything on to save money. Southwest flight attendants are happier than other airlines, and this leads to less employee turnover and higher customer retention. Which saves them money in the long run - it's just impossible to measure. He also noted that the hospital industry did an extensive survey of what the top hospitals in the nation had in common. The results: the nurses were happier and more involved in each one. \n Looking forward to the actual book, of which I now have a copy!", "date_added": "Thu Sep 23 09:27:55 -0700 2010", "date_updated": "Fri Sep 24 00:12:33 -0700 2010", "read_at": "", "started_at": "", "n_votes": 2, "n_comments": 4}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8694005", "review_id": "0e317947e1fd341f573192111bb2921d", "rating": 3, "review_text": "The Name of the Rose is a thrilling Dan Brown-esque murder mystery set in a 14th century Italian monastery. It really is two stories - the story of the murder mystery, and that of political climate in Italy at the time. And of course, they nicely interweave throughout. \n The history the book brought was one of my favorite parts. I learned about how the church controlled so much of the world, how even then it was already starting to fall from power, why saints are so prevalent in Italy, and more. I learned about Franciscans and Dolcians and minorites, and poverity and false monks. Poverty was a big theme, which came through on several levels: rebellions by poor people and religious leaders stepping in to lead the masses, and also an a debate about the role the Church should have in society. \n I loved brother William of baskerville. He was Sherlock Holmes-esque (so that can't be a coincidence he's from Baskerville right?) in his deductive reasoning and approach. I think my favorite moment of his was when he had no time left to solve the crime he said \"when a man has little time, he must take care to maintain his calm. We must act as if we had eternity before us.\" \n I took one star off because I often found myself skipping large sections that went into flowery details of something (often history) that just seemed irrelevant. \n The book was also a lot about change. The monks were so set in their ways and in their dogma that you could see how it likely took generations before a viewpoint could really change. The focus on humor for instance and the dogmatic viewpoint of Jorge was in my opinion simply nothing more than fear of change. We all know that the introduction of humor and the divine comedy didn't ruin the world. \n The library was one of the greatest in the world at the time. I would love to have seen it. Yet it was almost impossible to access, and that very lack of accessibility is what ultimately led to it's destruction. Seems like the message is that knowledge should be open and free and and keeping it locked up can be more dangerous than not.", "date_added": "Wed Sep 08 01:22:27 -0700 2010", "date_updated": "Wed Dec 14 12:30:43 -0800 2016", "read_at": "Mon Aug 10 00:00:00 -0700 2015", "started_at": "Mon Jul 20 00:00:00 -0700 2015", "n_votes": 17, "n_comments": 6}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "8213519", "review_id": "1044128b0d6dea81a41b4107378931b2", "rating": 5, "review_text": "An extremely well-written account of the 2008 financial collapse. It explained complex ideas like subprime mortgage bonds and CDO's in a clear way, and almost read like a fast paced thriller. \n Essentially it seems that a bad ratings system and human greed created an economy that fostered the creation of a lot of bad debts, that eventually went bad, and caused a lot of big companies to go under (Lehman brothers, Bear Sterns), or require a bailout (Goldman Sachs, AIG). This is the real crime. These big companies were so focused on short term profits that they failed to see that long term what they were doing wasn't going to work. They should be appropriately punished for this, and instead many of them were saved by Uncle Sam. Would we have had a worse recession if Obama hadn't done that? Maybe. Maybe not. Lewis should write another book about that :) \n Let me see if I can get this right. The book explains that mortgages are sold by the banks that issue them, passing off the risk. Mortgages are aggregated into groups in mortgage bonds, which are then packaged into tranches, which are rated by agencies such as Moody's and S&P's. The math was complex, but apparently somehow tranches that consisted almost entirely of \"subprime\" (aka risky) mortgages were being given high A ratings. I guess the theory was that by spreading out the risk across lots of mortgage bonds it lowered the risk. Too bad this didn't work. \n Many of these mortgages were the variety that started 2 year fixed then went floating. They were largely taken out in 2005 - 2006, and as they hit 2 years the interest rates jumped as they went floating, and hoards of people defaulted. This explains why we teetered in 2007 and crashed in 2008. One of my favorite quotes to illustrate the madness: \n \"In Bakersfield, California, a Mexican strawberry picker with an income of $14,000 and no English was lent every penny he needed to buy a house for $724,000.\" \n And it wasn't just in Bakersfield. All over the country people were taking out loans that were too big for their britches, because the banks were encouraging it: \n \"The simple measure of sanity in housing prices, Zelman argued, was the ratio of median home price to income. Historically, in the United States, it ran around 3:1; by late 2004, it had risen nationally, to 4:1. \"All these people were saying it was nearly as high in some other countries,\" says Zelman. \"But the problem wasn't just that it was four to one. In Los Angeles it was ten to one and in Miami, eight-point-five to one.\" \n Economics is about incentives, and this book explained how they went very awry. But it was also a story about greed, and how even unintelligent people made a lot of money by riding the subprime mortgage train. The book followed several investors who noticed what was happening, but when they tried to tell people and test their \"crazy\" hypothesis that the financial world was going to collapse, they were mocked or ignored. So they just ended up shorting (betting against) the whole thing to make some money, which is what a good investor does. \n \"What are the odds that people will make smart decisions about money if they don't need to make smart decisions--if they can get rich making dumb decisions?\" \n I think the lesson in the end is that if it looks to good to be true, it is. That, and we need smarter people working at the ratings agencies.", "date_added": "Thu Jul 08 07:33:27 -0700 2010", "date_updated": "Wed Mar 22 11:46:45 -0700 2017", "read_at": "Thu Oct 14 00:00:00 -0700 2010", "started_at": "Mon Sep 06 00:00:00 -0700 2010", "n_votes": 16, "n_comments": 7}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "7112495", "review_id": "0258b3c9a85cecb95f240e43a7642f60", "rating": 4, "review_text": "** spoiler alert ** \n An interesting book in terms of it's structure: 5 distinct stories that cascade into each other in subtle ways, then wind back out. This way of doing the structure was unique, and certainly very cool to see the subtle way they were tied together. But in the end it was kind of gimmick and probably not necessary. \n I generally don't try to summarize novels in my reviews, but in this case there was so much going on that the exercise was helpful. \n Story 1: The Pacific Journal of Adam Ewing. Later revealed to be a journal in other stories. A story about a rather weak-willed protagonist, who is constantly taken advantage of by others (the ships captain, Dr Goose). Interesting side story about the peaceful native Moriori tribe and how they were taken advantage of. \n Story 2: Robert Frobisher. Perhaps my favorite story - about a penniless young musician who as a last-ditch attempt apprentices himself to an old master musician, Vyvyan Ayrs. The story is told through letters to a friend, Sixsmith, who appears in the next story. The story is about how Frobisher, the apprentice, goes from being overjoyed to have a job to being resentful that the master is using him and stealing his stuff. Robert sleeps with VA's wife the whole story, but ends up falling in love with the daughter in a cruel twist of fate. \n Story 3: Luisa Rey. Modern age story about a young journalist hot on the heels of a big scandal involving an energy company. Sixsmith is an engineer who leaks the story to her, and also has the letters from story #2. Classic detective-esque story, with lots of people willing to kill to protect their secrets and power. \n Story 4: Timothy Cavendish. Modern age story about a book editor who gets a smash hit, then the author's mafia-esque family get's on his case and he's on the run. He lands in a old-persons home/prison. This story is kind of a nightmare, and is revealed to be a movie in the next story. \n Story 5: Somni 451. One of favorites, for how different it was. Set in the far future in an asian country, humans have genetically created clones that serve as slaves. This lower class is regarded as unintelligent and controlled with drugs - but our protagonist, Somni, breaks through and becomes self-conscious. The scary thing is I can easily see this happening! Told as recollections in an interview. \n Story 6: Sloosha's Crossin'. Story of Zach'ry and Meronym in post apocalyptic Hawaii. Somni is now their deity. Story of the Valleysmen people and their struggle for freedom against neighboring tribes. \n All six stories were very graphic and real, and had extremely good character development. Mitchel could with a single sentence describe someone that you understood in a way I can't describe here. \n I wish the stories had more themes in common so I could say what I learned from this book. Though I suppose if I had to put my finger on it, the major theme was freedom and slavery. Ewing was under the control of Dr Goose and the ship captain, Frobisher became an unwilling servant to Arys, Luisa Rey needed to find the truth in order to free herself from the corporate villians, Frobisher was a prisoner bent on escape in a nursing home, Somni was literally a slave in her society and focused on freedom, and Zach'ry's people were captured and enslaved. All the stories touched on various ways people can \"enslave\" and control other people for various reasons. \n I suppose the point is human beings are all greedy and will try to control other human beings, but if we are strong we can survive and find a way to free ourselves. Sounds good anyways, so I'll stick with that - but am interested to hear what other people thought.", "date_added": "Thu Jun 10 14:41:13 -0700 2010", "date_updated": "Tue Aug 07 12:11:05 -0700 2012", "read_at": "Sat Aug 07 00:00:00 -0700 2010", "started_at": "Mon Jul 05 00:00:00 -0700 2010", "n_votes": 7, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "7518289", "review_id": "265c3e164075223139bb33ed37f19937", "rating": 5, "review_text": "This is a book that every entrepreneur definitely needs to read, and everyone who works even remotely with Facebook needs to read. It does a simply amazing job going behind the scenes of Facebook and describing where the site came from, how it got to where it is, and where it's going. \n The author had amazing inside access to Mark Zuckerberg and other key Facebook employees and investors. Very smart of Facebook to include David so often - it makes their story fully open, which is consistent with the values of their company - not to mention good PR. \n The biggest takeaway I had was that Zuckerberg actually has much more of a vision and philosophy than I gave him credit for. The basic vision for Facebook is that it's a communication tool. It's very interesting to see that they think of it as a utility tool and not a media destination (like MySpace no doubt does). It means they are not afraid of sending traffic away from their site as long as they provide value up front - something that has been crucial to their success. \n Zuckerbergs philosophy however is more interesting - he believes being open is better and will lead to a better society. He thinks the internet will inevitably enable this anyways, so Facebook might as well lead the charge. It's an interesting and idealistic philosophy - basically that it's really hard for a person to be dishonest or immoral in any way if their whole life is laid open to their friends. In fact, one has to strive to be an even better person, because everything we do is not being tracked and if it isn't already online, it will be soon. The books we read, the things we buy, the people we date, the places we go, the people we associate with - all this is online, and defines who we are. Would my future children be proud of me if they examined my life's consumption? If I knew they were going to do so, would I make better choices? Absolutely. \n However the privacy road has rocked many people's worlds who haven't gotten the hint yet and EVERYTHING you put online, whether on Facebook or a seeming private place elsewhere, is ultimately public. The chapter on privacy listed many of these horror stories, and I certainly know more than a few stories of people who have been burned by having an inappropriate photo on Facebook or tweeting something inappropriate. The road to openness is happening - and I think Mark is right that it's going to make us better as a society. The danger, however, is that it will still cause many people a lot of pain as we get there - and may cause many to ultimately retreat from Social Networking (and the internet). I think Mark knows his responsibility there as his service depends on it, and I hope he's a good steward, as this is certainly a topic we debate a lot at Goodreads. \n I worked in Social Networking during the Rise of Facebook - my company, Tickle, is even mentioned a few times in the book. This book made the mistakes we made at Tickle even more apparent. Hindsight is a ...! For instance, starting with colleges that were *private* was what really worked - everyone had no problems sharing everything with their fellow classmates and alums. \n Facebook's biggest product innovation though was of course Platform. Followed perhaps by the Like button and Facebook Connect - which are really only possible because so many people use Facebook. Both were big wins, and were interesting pushed hard by Zuckerberg, and their success really validated him as a leader internally. \n One interesting note that I hadn't considered was that because everyone uses their real names on Facebook, blogs that use Facebook Connect for comments (eg Huffington Post) don't have the troll problem as much, because of the openness issue (see above). \n The book was also very interesting as it gave a lot of the details of how Facebook was financed, how the VC deals were structured, what sort of offers it got, etc. Zuckerberg was courted to sell by so many large companies, I had always wondered how he had the nerve to say no - most in his shoes would have sold out for millions or billions long ago. The answer seems to be that he doesn't really value money, and also that he knows this is his big Life's Opportunity to change the world - and to sell now would be to squander it. \n The book also gave interesting insight into where Facebook thinks they are going. In the future they think they will be less of a destination site, and more of a social communication enabler. Everything that can be social will be, and it will be done with Facebook. Every website you visit, your TV, video games, and perhaps even your cereal box will one day have Facebook Connect.", "date_added": "Fri May 14 13:11:51 -0700 2010", "date_updated": "Thu Sep 22 14:31:47 -0700 2011", "read_at": "Sun Dec 12 00:00:00 -0800 2010", "started_at": "Sat Nov 27 00:00:00 -0800 2010", "n_votes": 33, "n_comments": 11}
